{
  "blogContent" : {
    "-MHrtzpf94QBrRmta3k9" : [ {
      "p" : "* Note: This is currently a stock article. *"
    }, {
      "p" : "Doctrine is very important in the Christian life. It allows us to divide falsehood from truth. Doctrine, of course, is a matter of the mind. But it is also a matter of the heart."
    }, {
      "p" : "The reality is, it is absolutely impossible to free oneself from doctrine. Everyone believes certain doctrines, whether they wish to admit it or not, and everyone needs to be dilligent as to which doctrinal principles they will accept and which they will reject."
    }, {
      "h3" : "Everyone Believes Doctrines"
    }, {
      "p" : "Even agnostics believe in certain doctrinal principles. They believe the doctrinal principle that humans can come to any particular doctrinal principles about God (save this one). Athiests, similarly, believe the doctrinal principle that there is no God, and thus every other belief about God is false."
    }, {
      "p" : "Even agnostics believe in certain doctrinal principles. They believe the doctrinal principle that humans can come to any particular doctrinal principles about God (save this one). Athiests, similarly, believe the doctrinal principle that there is no God, and thus every other belief about God is false."
    }, {
      "h3" : "Christians Need to Be Explicitly Doctrinal"
    }, {
      "p" : "The reality is, it is absolutely impossible to free oneself from doctrine. Everyone believes certain doctrines, whether they wish to admit it or not, and everyone needs to be dilligent as to which doctrinal principles they will accept and which they will reject."
    } ],
    "-MN_CvUuFui4b6h7yfc_" : [ {
      "p" : "In progress / stock article"
    }, {
      "p" : "Christians in America live in a very post-authority world, on both sides of the political spectrum. The conservative pitch for a little gun-powered resistance to tyranny and the recent widespread leftist riots (persistently justified by liberals) both present an attitude towards government not in line with Romans 13. Indeed, for a somewhat libertarian conservative like me, Romans 13 is a constant, sobering reminder that I, like it or not, must obey my government."
    }, {
      "p" : "But the anti-authority disposition of Americans manifests itself in countless other ways. The sexual revolution of American is a revolt against biblical authority on sexual morality. The raging extremes of feminism regard the tiniest whiff of male authority as the deadliest threat to woman. The rugged individualists seem to think that only a man who answers to no external authority can truly be free. Today, churches calling themselves Christians feel increasingly at liberty to disregard the authority of the Bible in matters such as gender, fornication, and homosexuality."
    }, {
      "p" : "God is the ultimate authority within the universe. We have God on top, and every created being somewhere beneath him. The prevalence of authority structures is a striking feature of God's creation. There are archangels over all the other angels. Satan rules over his demons. Humans rule over the animals. Churches obey God. Elders lead their churches. Husbands lead their wives. Governments rule over their people. The Bible consistently upholds God-ordained structures of authority in creation."
    }, {
      "p" : "But what is even more interesting is that this very attribute of creation mirrors the biblical teaching about God's nature. The triune God himself has an internal authority structure. The Son obeys the Father. The Spirit obeys the Son and the Father. Of course, we cannot take any similarity between God and his creation too far. There are some highly noticeable differences (ie. the Creation has fallen into sin while God is perfectly holy). But looking at the similarity the way the Bible frames it can gives us helpful insights into how Christians are supposed to deal with authority."
    } ],
    "-MRGzr7JPENTZ9MP2_ND" : [ {
      "p" : "In Progress..."
    }, {
      "p" : "Many challenges have been waged against the doctrine of the Trinity throughout the history of the church. Raised in a tradition that presented one of these challenges, I have been well-accustomed to an anti-trinitarian position. Through much honest consideration of the Word of God, however, I have come to believe that the Trinity is an accurate understanding of God’s revelation about Himself."
    }, {
      "h3" : "Two Guidelines"
    }, {
      "p" : "I want to begin by setting two guidelines for discussion. The first concerns what question we are asking when we debate the Trinity, and the second concerns how that question should be answered."
    }, {
      "h4" : "God is One"
    }, {
      "p" : "The question we are asking when we debate the Trinity is not whether there is one God or three. The Bible is perfectly, consistently clear that there is only one God in heaven and earth. Here are just a few examples: Deuteronomy 6:4, “Hear, O Israel: The LORD our God, the LORD is one;” 1 Corinthians 8:4, “‘There is no God but one;’” Ephesians 4:5, “There is “one Lord, one faith, one baptism.” Thus, the Bible clearly affirms the doctrine of monotheism: there is one God, and one God only."
    }, {
      "p" : "The real point of question is about the nature and scope of the oneness of God. Most Christians can agree that God is one in essence and one in Being, but some disagree about whether God is one or three in person. We can agree that God is singular, the one and only true God. We can agree that this only God is one Being with one ultimate essence. The question is whether or not there is, inside God's singularity of existence and unity of being, a plurality of person. In other words, is there an element of plurality inside the ultimate unity of God?"
    }, {
      "p" : "The word trinity is a combination of tri- (three) and unity (one). It is not tri-theism (three Gods), but tri-unity (three in one). The doctrine is summed up like this: God is one in essence and three in person. This may seem like a contradiction, but consider a couple of imperfect analogies. Imagine there is a world in which there exists only one immense and beautiful tree. We could say that this tree is the only tree that exists. We could also say that it is not two trees, or three trees, but one tree. It is both singular in its existence, and one in its essence. Yet, this one tree still has a multitude of branches, thousands of leaves, and a great many roots. In other words, a thing can be one in the ultimate sense, and singular in its existence, and yet still have an internal element of plurality. Consider your very own existence. You are one human being, and you are the only human being like you. However, you have a body, and a soul, and a spirit, and a will, and a mind. You are one being yet you have multiple layers to your existence. Thus, it is not a refutation of the Trinity to simply state that God is one. We have to discuss the nature and scope of his oneness and deal with the element of triunity ascribed to God in the Scriptures."
    }, {
      "h4" : "Scripture is Final"
    }, {
      "p" : "So, with this question in mind, how should we answer it? The only way to answer a question about the nature of God is to search and study the Word of God. Though there can certainly be elements of plurality inside an ultimate unity, the idea of three persons sharing one essence is still a mystery hard for our feeble minds to comprehend. Nevertheless, the Trinity is not false because it does not make sense to you, or to me, or to anyone else. Man’s ability to comprehend what can only be considered a divine mystery is of no consequence, for \"great indeed, we confess, is the mystery of godliness\" (1 Timothy 3:16). What matters is the testimony of the Scriptures. If we truly want to answer a question about the nature of God, then we must consider what God has said about Himself. God’s Word triumphs over man’s reasoning. And if the conclusion of God’s Word results in a mystery that is difficult for our human brains to understand, then glory to Him who alone holds the answer, whose desire to reveal what He has revealed and conceal what He has concealed can be questioned by none."
    }, {
      "h3" : "Who is Christ?"
    }, {
      "p" : "Now as to the exact method of answering this question scripturally, there is additional difficulty, for in this one question there lies an intense myriad of appropriate considerations. An effective way to begin our discussion, it seems to me, is to ask this secondary question: who is Christ? Christ is the cornerstone of the Christian faith. He is at the heart of the fundamental distinction between Christianity and other monotheistic religions. The God whom the Jews now worship did not enter into human flesh, nor has the God of Islam taken upon himself the sins of the world. Thus, the Gospel of Christ gives rise to a remarkable and crucial divergence of Christianity from the world's others religious traditions. If we wish, then, to understand the New Testament revelation of who God is, we must start by understanding who Christ is."
    }, {
      "h4" : "The Logos"
    }, {
      "p" : "Perhaps the most important and succinctly informative text about Christ can be found in the first part of the first chapter of John."
    }, {
      "p" : "“In the beginning was the Word, and the Word was with God, and the Word was God. He was in the beginning with God. All things were made through him, and without him was not any thing made that was made. In him was life, and the life was the light of men. The light shines in the darkness, and the darkness has not overcome it.“ — John 1:1-5"
    }, {
      "p" : "From these verses, we can learn a great many things about Christ."
    }, {
      "h4" : "Christ the Logos"
    }, {
      "p" : "The Greek word translated “Word” is /i logos/, from which we derive the word /i logic/. The Word clearly refers to Christ the Son of God, for in verse 14 we read, “And the Word became flesh and dwelt among us, and we have seen his glory, glory as of the only Son from the Father.” This one word identification of Christ is immensely profound and significant. Christ is the logos: the logic, the wisdom, the acting source of all order and harmony and coherence in the universe. In the first verse, John describes the Logos in three important ways. First, the Logos was “in the beginning.” Second, the Logos “was with God.” And third, the Logos “was God.”"
    }, {
      "p" : "The phrase “in the beginning” might sound familiar to you, for it is contained in Genesis 1:1: “/i In the beginning/, God created the heavens and the earth.” The implication, therefore, is that the Logos was there in the beginning, before and outside of the creation. This is further affirmed in verse 3: “all things were made through him and without him was not any thing made that was made.” The Logos must have existed before the creation and outside of the creation, and the Logos must be uncreated himself, because all creation presupposes his existence. If all things were created through him, then how could he have been created? Can he be created through himself if he does not already exist? Surely not. He exists eternally, without origin, and all things were created through him."
    }, {
      "p" : "Then, John states that this Logos, in the beginning, through whom all things were made that were made, was both with God and was God. Ponder this profound mystery. In one phrase, the Logos is distinguished from God, for to be with God implies a distinction from God. We see an element to the existence of the Logos that is distinguished from God. Yet then, in the next phrase, the Logos is identified as God. “The Word /i was with/ God, and the Word /i was/ God.” Thus, it becomes apparent that John is using the word God in two different ways. When he says the Word was with God, we see the Son “at the Father’s side” (John 1:18), in personal relationship with the Father, and when he says the Word was God, we see the unification of the Son and the Father (and the Spirit) in one essence of godliness. In other words, we see both plurality and unity."
    }, {
      "p" : "Now look again at verse 14: “And the Word became flesh and dwelt among us, and we have seen his glory, glory as of the only Son from the Father.” Not only was this Word with God, and not only was he God, but he became flesh. In this it becomes clear that the apostle John, when referencing the Word, is referring directly to the living, breathing Jesus, the only Son from the Father. Consider also verses 4 and 5, \"in him was life, and the life was the light of men. The light shines in the darkness, and the darkness has not overcome it.\" Later in John, we find that Jesus is the life (John 14:6), and Jesus is the light of the world (John 8:12). Jesus is the one who became flesh, conceived of the Holy Spirit and born of a virgin (Matthew 1:18). And Jesus is the one to whom John the Baptist bore witness, saying, “He who comes after me ranks before me, because /i he was before me/” (John 1:15). So, Christ is he who was with God, who was God, and who became flesh and dwelt among us. Herein lies the orthodox understanding of who Christ is. Jesus Christ is fully God and fully man, and these two natures, godliness and manliness, are united into one Person, the Son, who eternally shares the one essence of God with the two other divine Persons, the Father and the Holy Spirit."
    }, {
      "h3" : "Christ is ..."
    }, {
      "p" : "Let’s break this down. First of all, Jesus Christ is fully God—the Word /i was/ God—which carries a whole lot of meaning. To flesh it out, let me point you to Colossians 1:15-20, which talks of Christ, “[God’s] beloved Son, in whom we have redemption, the forgiveness of sins” (vs. 12):"
    }, {
      "p" : "“He is the image of the invisible God, the firstborn of all creation. For by him all things were created, in heaven and on earth, visible and invisible, whether thrones or dominions or rules or authorities—all things were created through him and for him. And he is before all things, and in him all things hold together. And he is the head of the body, the church. He is the beginning, the firstborn from the dead, that in everything he might be preeminent. For in him all the fullness of God was pleased to dwell, and through him to reconcile to himself all things, whether on earth or in heaven, making peace by the blood of his cross.”"
    }, {
      "h4" : "The Image of God"
    }, {
      "p" : "This text contains numerable beautiful truths about Christ. First of all, Jesus Christ is “the image of the invisible God.” The invisible God, whom no man has even seen, has sent forth his beloved Son as an image or perceivable revelation of Himself. In Hebrews 1:3, we read that Jesus is “the radiance of the glory of God and the exact imprint of his nature.” So Jesus, the image of the invisible God, is the exact imprint or representation of God’s nature; there is not a single flaw, difference, or inconsistency. And, in being both an exact representation and a perceivable revelation, Christ becomes the radiance of the glory of God. He is rightly called the “light of men” because, in revealing God to man, he himself has revealed and embodied the radiance of God’s glory, displaying its beauty and brightness and grandeur to all creation in redemption. A similar idea is expressed in John 1:18 (NASB), which reads, \"No one has seen God at any time; God the only Son, who is in the arms of the Father, /i He has explained Him/.\" We therefore conclude thus: Jesus Christ is the image of God, the exact imprint of his nature, the radiance of his glory, God the only Son sent by God the Father to explain God to man. Thus, Jesus asserts in John 14:9, “Whoever has seen me has seen the Father.”"
    }, {
      "h4" : "The Firstborn of all Creation"
    }, {
      "p" : "Let us ask a second question: /i how/ is Christ the image of God? /i Why/ is he the exact imprint of his nature, and the radiance of his glory? How did that happen? The next phrase in Colossians 1:15 tells us that Christ is \"the /i firstborn/ of all creation.\" The term firstborn here is also used in the Bible to refer to the eldest child. In John 8:42 and 16:27, Jesus says he “came from God,\" and in 16:28 explains, \"I came from the Father and have come into the world, and now I am leaving the world and going to the Father.” Thus, we know that Jesus is born or begotten of the Father. This, it would seem, is the entire basis for their titles \"Father\" and \"Son.\" The Son is the Son insomuch that he is born of the Father, and the Father is the Father insomuch that the from Him the Son is born. We also know that Jesus is the /i firstborn/ Son of the Father, and the \"/i only/ begotten Son\" of God (John 3:16, KJV). Now, what does this have to do with Jesus being the image of God? Genesis 1 tells us that God created man in his own image. How much more would the first and only begotten Son of God perfectly mirror the Father from whom he comes? As the old saying goes, the apple doesn't fall far from the tree. This is not to imply that Jesus is \"born\" in the same way that Adam and Eve were created by God, or that we are born. Rather, it is to emphasize that what comes from the Father is like the Father in every respect, the image of God, and naturally becomes \"the radiance of the glory of God,\" \"the exact imprint of his nature.\""
    }, {
      "h4" : "The Mediator of all Creation"
    }, {
      "p" : "Then, in Colossians 1, we read that \"by him all things were created, in heaven and on earth, visible and invisible, whether thrones or dominions or rules or authorities—all things were created through him and for him.\" All creation, visible and invisible, in heaven and on earth, was by the Son, through the Son, and for the Son. Remembering that Jesus is called the Word, or the logos, brings even more depth and beauty to this truth, because in Genesis God creates by speaking. \"And /i God said/, 'Let there be light,' and there was light\" (Genesis 1:3). We see, then, that God's creation was mediated by the Word, the acting source of of all order and harmony and coherence in the universe, as He spoke all things into existence. We understand that the Word was not an impersonal force, but the very Son of God, \"in the arms of the Father\" (John 1:18, NASB), \"with God\" (John 1:1). And we know that the Word was not separate or disconnected from God, or created by God, but indeed \"was God\" (John 1:1)."
    }, {
      "h4" : "Preeminent in Everything"
    }, {
      "p" : "Next in Colossians 1:17, we read: \"And he is before all things, and in him all things hold together.\" From the idea that Christ mediated the creation of all things, we can easily infer that he is before all things; he must have been there in the beginning, before all things were created, in order to mediate the creation of those things. But then another detail is given: \"in him all things hold together.\" It was not as if God created the world through his Son, left it there, and moved on. Rather, the existence of all creation continuously depends upon the Son sustaining it. At any moment, he could take all things out of existence, or do with creation whatever he pleases, and the only reason that the world persists is that God has willed it so."
    }, {
      "p" : "Next we find in vs. 18: \"He is the beginning, the firstborn from the dead, that in everything he might be preeminent.\" We know that Christ was before all things, or in the beginning, but now we learn that he /i is/ the beginning. Not only is he the firstborn of God, but also the firstborn from the dead — Jesus Christ was the first in history to ever experience and overcome death, and not just physical death, but the spiritual death that he tasted for every man. Thus, in everything he is preeminent, \"the Alpha and the Omega, the first and the last, the beginning and the end” (Revelations 22:13). This is important because it confirms that Jesus was outside and above and before the realm of creation. It was not as if the Father gave birth to the Son in 10,000,000 BC, and then created the universe through him in 10,000 BC. The Son is not begotten of the Father in the same way that we are begotten of our parents because we are born in time, while Jesus was born beyond time. The Son was begotten of the Father from eternity past, and will remain at his right hand to eternity future. He was the perfect image of God and the radiance of his glory before time, and remains such throughout time and into eternity. Thus, the birth of the Son should be seen in more of a logical way than a chronological way. The Son is begotten of the Father in a natural and logical way for all of eternity, owing to the glorious complexity of the internal reality of God, rather than at a specific point in history. He is, in everything, preeminent."
    }, {
      "h3" : "Christ is Truly God"
    }, {
      "p" : "Finally, Colossians 1 asserts that in Christ \"all the fullness of God was pleased to dwell.\" The image of God is not a shell of God. It is not, as paintings on Earth, a flat and static picture. Rather, in Christ lies all the fullness of God, every last drop of it. And not only does the fullness of God dwell in Christ, but it is /i pleased/ to dwell in Christ. As the Son is begotten of the Father from eternity past, so the entire fullness of God has never ceased to dwell in him, and to be pleased to dwell in him. Again, it is not like human procreation, where children become both physically and spiritually separate from their parents. The Son remains completely one with God, united in his essence, the entire fullness of God pleased to dwell in him."
    }, {
      "h3" : "Christ is Truly Man"
    }, {
      "p" : "Thus we can conclude that Jesus Christ is truly God. But in Scripture we come to a second profound mystery: Jesus Christ is truly man. We have seen that he was born of a virgin in human flesh. And many other verses in Scripture confirm that Christ took on the fullness of humanity, save that he was without sin. Hebrews 2:14-18 tells us, \"Since therefore the children share in flesh and blood, /i he himself likewise partook of the same things/, that through death he might destroy the one who has the power of death, that is, the devil, and deliver all those who through fear of death were subject to lifelong slavery. For surely it is not angels that he helps, but he helps the offspring of Abraham. Therefore he had to be made like his brothers /i in every respect/, so that he might become a merciful and faithful high priest in the service of God, to make propitiation for the sins of the people. For because he himself has suffered when tempted, he is able to help those who are being tempted.\""
    }, {
      "p" : "Consider the marvelous beauties of this text. Christ saw us, that we were men in bondage to the fear of death. He saw our weakness and our sins, and he had pity on our state. So what did he do? He became like us in every respect, taking on our flesh and blood to taste death for us so that we may live, to make propitiation for our sins so that we might be forgiven, to suffer in temptation so that we might be helped in our weakness. Christ was not content to stay only God, but he took on flesh and became a man like us. For it was God's plan from the foundation of the world to reconcile everything to Himself through His blessed Son. Jesus Christ, the Son of God, became the Son of Man, that he might reconcile man to God. He does not cease to be God, but nor does He now in heaven cease to be man. Jesus Christ is truly God and truly man."
    }, {
      "h3" : "Christ is a Person"
    }, {
      "p" : "*Below is miscellaneous and under revision*"
    }, {
      "p" : "To rob Christ of his deity is to rob the Godhead of Christ, and to rob the Godhead of Christ is to rob redemption of its power."
    }, {
      "p" : "Now, if the fullness of God is truly pleased to dwell in Christ, then a great difficulty arises in describing the nature of Christ's existence. If Christ was man given the nature of God, then some questions certainly arise. But if Christ is God become man, then our difficulty is the more expanded. For if God is a spirit, then how can he inhabit flesh? For 1 Timothy 3:16 states, \"He was manifested in the flesh.\" If Christ was conceived by God's Spirit and given His Spirit, then as he shares the godly nature, the union is the nature of his godliness. (I honestly have no idea what I was trying to say here.) Is Christ, as the Trinity proposes, a divine person, sharing with the Father and the Spirit in the one nature and essence of God but remaining as his own distinct person? Or is the Son simply a mode in which God acts?"
    }, {
      "p" : "There was a man sent from God, whose name was John. He came as a witness, to bear witness about the light, that all might believe through him. He was not the light, but came to bear witness about the light. The true light, which gives light to everyone, was coming into the world. He was in the world, and the world was made through him, yet the world did not know him. He came to his own, and his own people did not receive him. But to all who did receive him, who believed in his name, he gave the right to become the children of God, who were born, not of blood not of the will of the flesh nor of the will of man, but of God. And the Word became flesh and diet among us, and we have seen his glory, glory as of the only Son from the Father, full of grace and truth. (John bore witness about him, and cried out, ‘This was he of whom I said, “He who comes after me ranks before me, because he was before me.”’) For from his fullness we have all received, grace upon grace. For the law was given through Moses; grace and truth came through Jesus Christ. No one has ever seen God; the only God, who is at the Father’s side, he has made him known.” — John 1:6-18 "
    }, {
      "p" : "Hebrews 1:1-4, “Long ago, at many times and in many ways, God spoke to our fathers by the prophets, but in these last days he has spoken to us by his Son, whom he appointed the heir of all things, through whom also he created the world. He is the radiance of the glory of God and the exact imprint of his nature, and he upholds the universe by the word of his power. After making purification for sins, he sat down at the right hand of the Majesty on high, having become as much superior to angels as the name he has inherited is more excellent than theirs.” "
    } ],
    "-MhtYh1PcEAinLKEh5F9" : [ {
      "h3" : "What is morality?"
    }, {
      "p" : "Few questions strike more at the heart of the human experience than what we ought to do. We can ponder and observe the reality of what we in fact do. We can ask such profound and deep questions as where we come from and why we are here. But eventually, and most practically, we must ask what we /i ought/ to do: for why should we seek to know how and why we are here if not to discover what exactly it is we are supposed to be doing?"
    }, {
      "p" : "The question is a tricky one because the idea that we /i ought/ to do something or /i ought not/ to do something -- the concept of obligation -- implies systems or hierarchies of value. If I am fundamentally obliged to act in one way and not the other, there is an assumed /i reason/ for the obligation, which implies /i values/ that make such a reason potent. If you say that I ought not to murder strangers in cold blood, the natural question to ask is /i why not?/ To answer this, you start with the conjunction, /i because/, indicating a reason, /i murdering strangers in cold blood is wrong/. But then I ask, /i why is it wrong?/ And to answer that, eventually you have to appeal to some value: something which has relevant importance. Perhaps murdering strangers is wrong because people are valuable, and to intentionally kill them with no conceivable justification is to insult their individual value in the highest regard and therefore murder is wrong in direct proportion to the value of human beings. The point is that obligations imply reasons, and reasons imply values."
    }, {
      "p" : "The question goes even farther than values, however, because the idea that we ought to do something implies consequences for failing to do it. If we ought not to do something, and we do it, or ought to do something and do not, then there is an implied consequence for failing to fulfill our obligation. Alternatively, if we ought to do a thing and we in fact do it, them there is implied to be some degree of reward. If obligations imply reasons and reasons imply values, then those values necessitate some manner of enforcement. If we truly believe that humans ought not to murder strangers in cold blood, and we believe this based on a fundamental belief in the value of human beings, then we will naturally demand punishment for anyone who violates their moral obligation not to murder strangers, and that punishment should be proportional, at least, to the primacy of the values in question and the degree to which such values were insulted."
    }, {
      "p" : "Thus, in the concept of morality, we have the question of how we as human individuals in the world and in relationship to each other ought to act. Consequently, we have the questions of what values our actions should be predicated upon, what consequences should be imposed when such values are violated, and similarly what rewards should be offered when such values are exceptionally respected."
    }, {
      "h4" : "The Transcendent Question"
    }, {
      "p" : "But shall I suggest yet another level of importance to morality? We as humans seek not only to answer how we ought to act in relation to each other, but how we ought to act in relation to something higher than ourselves. If there is anything true about man it is that he is incurably religious, for better or for worse. And a fundamental question of religion is whether a higher Being or higher beings exist, and how we ought to relate to that Being or those beings. How could the Aztecs kill so many of their citizens in service to their religion? Perhaps they were just incredibly brutal people, or perhaps those in power were willing to do anything to establish their supremacy. Or perhaps, I shall suggest, they believed that in doing such an atrocious thing they were fulfilling a more fundamental requirement than anthropocentric morality: theocentric morality. (Or perhaps I am wrong...) But how, I ask did the Catholic church justify the Crusades? How does Islam justify its slaughter and enslavement of Christians and rampant mistreatment of women? The religious questions of morality -- questions which refer to transcendent, metaphysical reality -- are incredibly potent, and as history has demonstrated, incredibly dangerous."
    }, {
      "p" : "Now you may wonder why I, as a Christian, am willing to admit so openly the danger of religious moralities. For one, I do so because of the outspoken demonstration of this danger in history. Religious beliefs can and do motivate people to do horrible things. But even in admitting this, I cannot quite see how atheism -- or an attempt to totally abandon religious beliefs  -- solves the problem, for atheism itself has no innocent history: simply observe the Soviet Union. Indeed, while religious beliefs can be used to justify atrocity, they also in great degree are what prevents atrocity. If I believe that there is a Being or beings higher and more powerful than I, and that such Being or beings will hold be accountable for all of my actions, then I simply do not have the liberty to do every awful thing I might desire. Sure, religious justifications for wrongdoing can be a dangerous narcotic to the human conscious, but what about the prospect of no ultimate accountability? Man may punish me for my crimes, but the worst they can do, in the end, is kill me, and then I only cease to exit. No one can punish me past the grave. If I am cunning, strong, and powerful enough to avoid accountability from other people while I live, then what exactly is to prevent me from acting in the worst way possible? You see, if there is no God, I may have no transcendent justification to do awful things, but I have no transcendent reason not to do awful things either. Thus we end up with just as dire a predicament."
    }, {
      "p" : "What is the point of all this? The point is, first of all, that the fundamental question of morality inevitably reaches beyond the physical realm into the metaphysical and transcendent, whether we end up appealing to a higher authority or reason or try to demonstrate the lack thereof. Secondly, how we answer this question has enormous consequences for individuals and society. If we go the purely naturalist route and seek to develop a purely non-transcendent morality, we must justify why anybody should ultimately follow such a morality in the first place and attempt to the greatest degree possible to enforce it. And if we go the super-naturalist or transcendent route, we must be incredibly careful not to create religious justifications for evil things (supposing something can be determined evil in the absence of religious belief)."
    }, {
      "h3" : "Where does morality come from?"
    }, {
      "p" : "Morality involves what we ought to do, the values that determine what we ought to do, and the punishments that are necessary when theses values are insulted. Morality, as we can easily observe, has tremendous and dangerous ramifications for all of our lives. The question then becomes remarkably important of, \"Where does morality come from?\" If morality is so fundamentally important and drastically impactful, then we must be extraordinarily careful and thoughtful about how we seek to derive it. How can we know what is right and what is wrong?"
    }, {
      "h4" : "Miscellaneous"
    }, {
      "p" : "And from the perspective of my individual existence, why is acting charitably to other any more justifiably than acting entirely selfishly. Shouldn't I maximize my possessions, comforts, and enjoyments to the greatest degree possible? You may reply that acting charitably in a society actually maximizes your comforts and possessions, because people can accomplish more in collaboration than when alone.  I also cannot ignore the potency of atheism either. To say that religious beliefs are the only or even main danger to mankind is "
    } ]
  },
  "blogContentArchive" : {
    "-MHru1z7pRuQxHdKecEN" : [ {
      "p" : "This is about the heart. The heart is important."
    }, {
      "h3" : "Everyone Believes in the Heart"
    }, {
      "p" : "Even hearts are amazing."
    } ],
    "-MHru5-r9fquK12Gbbf1" : [ {
      "p" : "This is about the heart. The heart is important."
    }, {
      "h3" : "Everyone Believes in the Heart"
    }, {
      "p" : "Even hearts are amazing. I updated this paragraph."
    }, {
      "p" : "I added this paragraph."
    } ],
    "-MHruUy1Yb6IJR40olBH" : [ {
      "p" : "Self-love delusion is very bad."
    }, {
      "h3" : "Everyone Loves Themselves"
    }, {
      "p" : "We need to learn how to love God and others."
    }, {
      "p" : "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Praesent finibus euismod nulla, ac gravida mi dictum commodo. Aenean molestie mi eu lobortis mattis. Vestibulum viverra risus lacus, at sollicitudin nulla ullamcorper sit amet. Praesent auctor est turpis, ut porttitor arcu maximus sit amet. Donec nibh mauris, auctor sed eros in, aliquet molestie velit. Curabitur porta eget quam a blandit. Aliquam vitae mauris vel magna imperdiet elementum. Nam rutrum nulla at risus hendrerit tristique. Cras vitae convallis orci, in aliquet urna. Nunc mattis volutpat ornare. In sed lectus varius, posuere metus vitae, convallis nunc. Vestibulum sapien ligula, luctus vel massa eu, pharetra aliquam ex. Phasellus ullamcorper quam tincidunt, dignissim arcu ut, pharetra tellus. Etiam sed egestas nulla. Vestibulum libero dui, pharetra bibendum nisl nec, rutrum tristique ipsum. Vestibulum vitae malesuada nunc, ultricies tempus elit."
    }, {
      "h3" : "Loren Ipsum Dolor"
    }, {
      "p" : "Phasellus varius, elit a feugiat eleifend, massa dolor facilisis quam, ut mollis velit nisl nec mi. Aliquam malesuada eros ex, faucibus imperdiet nisi iaculis vel. Aenean ac est ac enim facilisis suscipit. Nunc quis imperdiet sem, aliquam auctor dolor. Morbi consectetur elit risus, eu commodo nisl pharetra ac. Nulla aliquam ex ipsum, sed vestibulum quam ullamcorper ut. Maecenas nulla tellus, condimentum eu scelerisque at, feugiat non ante. Vestibulum vestibulum, nisl ac condimentum ornare, neque ligula lobortis nibh, quis ornare arcu nibh in arcu. "
    }, {
      "p" : "Curabitur interdum hendrerit massa nec rutrum. Integer ultricies lorem sit amet justo viverra, in convallis arcu ullamcorper. Quisque pharetra fringilla fermentum. Suspendisse quis turpis fermentum, convallis ante nec, tristique nisl. Nulla sed sagittis erat. Interdum et malesuada fames ac ante ipsum primis in faucibus. Integer vulputate, nisl a imperdiet posuere, enim nisi ultrices leo, et efficitur ex dui in ligula. Vivamus viverra dui non est faucibus, in volutpat neque interdum. Nullam ex nisi, convallis in auctor quis, viverra in tellus. Fusce arcu quam, tincidunt quis sodales eu, euismod eu libero. Donec fermentum diam sed mattis facilisis. Vestibulum dapibus imperdiet ligula non interdum. Ut lacinia, nulla eget luctus eleifend, velit massa vehicula est, lacinia porttitor diam leo eu magna. In blandit ex massa, in vulputate dolor laoreet sed. Proin mi nisi, fringilla eget turpis quis, vivera rhoncus risus. "
    } ],
    "-MIAQ6EILtwo7q720wpM" : [ {
      "h3" : "Header"
    }, {
      "p" : "Paragraph"
    } ],
    "-MIAT2_JJKwydZvJQZBw" : [ {
      "h3" : "Header"
    }, {
      "p" : "Paragraph 2"
    } ],
    "-MIAVXAxxhYdzFD8j1Rq" : [ {
      "h3" : "Header"
    }, {
      "p" : "Paragraph"
    } ],
    "-MIAb2_9rmPJBPJxels_" : [ {
      "h3" : "Header"
    }, {
      "p" : "Paragraph"
    } ],
    "-MIAfGadBqxbOAiD8e0n" : [ {
      "h3" : "Header"
    }, {
      "p" : "This is a nice new article!"
    } ],
    "-MJ_J81olOiqndVKS7oE" : [ {
      "h3" : "Introduction"
    }, {
      "p" : "There are many good Biblical reasons to believe that abortion is immoral, and if the Lord wills, I will write about them many times in the future. But in this article, I would like to present the strongest secular argument that I can muster as to why abortion is morally wrong and unacceptable for society."
    }, {
      "h4" : "Terminology"
    }, {
      "p" : "Before I begin, a note on terminology. Conception occurs when a sperm cell fuses with an egg cell. The result is a single-celled human organism called a zygote. The zygote immediately begins dividing rapidly to form a multi-cellular embryo. After several weeks in the womb, this embryo has grown and developed enough to be recognizably human and is then called a fetus. The term fetus applies until the human is born from the mother's womb. I use the term baby generally to describe the human organism at any of these developmental stages, zygote, embryo, or fetus. Abortion, by definition, is the termination of a pregnancy and thus constitutes ending the life of that human organism (more on this later). The term pro-life describes the position that abortion should be restricted or even outlawed by the government because it takes a human life; one could also call it anti-abortion. Pro-choice, on the other hand, describes the position that the government should let the mother decide whether or not to have an abortion with limited to no government restrictions. Pro-choicers are not necessarily pro-abortion, but some of them are. "
    }, {
      "p" : "I use the term life, lowercase, to describe things that are scientifically living (they exhibit the characteristics of life). The term human applies to any organism that has human biology and genetics, as opposed to the biology of a bear or a tree. Zygotes are thus characteristically human; they are not eagle eggs or plant seeds, they are human zygotes. The term person is more philosophical. Persons are individuals who have natural rights—say, to Life, Liberty, and the Pursuit of Happiness. In my mind, Life, uppercase, is a right not only to be biologically living, but to really, truly /i live/: to make friends, learn things, fall in love, have a family, build a community, and so on. "
    }, {
      "h3" : "Laying the Foundation"
    }, {
      "p" : "I find it necessary, before we engage in any specific questions about abortion, to step back and lay a broader moral and philosophical foundation. The question of abortion being a moral and philosophical one, it is simply impossible to separate it from any and all moral and philosophical (and often religious) principles."
    }, {
      "p" : "In the first place, I find it virtually impossible to have any sort of meaningful conversation about abortion unless we can agree on the broad moral principle that human life is sacred and should be protected from anything that harms or seeks to harm it. Moreover, human life has a certain dignity, a value and worth; you might even say that all people have \"certain unalienable Rights,\" and that these are theirs simply because of their personhood. It is these related principles that make murder wrong. They are why slavery is evil. They are, indeed, why rape is disgusting and horrible."
    }, {
      "p" : "Another related principle, perhaps more the philosophy of government than morality, is that government does indeed legislate moral principles, such as the ones I just mentioned. In the first place, consider the Declaration of Independence: \"We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness. — That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed.\" The connection is clear: the chief end of government is to \"secure ... rights,\" and these right explicitly include the right to \"Life.\" Thus, our American government was instituted to secure and protect and therefore to legislate the security and protection of the right to Life. The government, then, was explicitly created to legislate a moral principle."
    }, {
      "p" : "To give a more practical defense, the government's ability to legislate morality is the backbone of our entire justice system. If the government cannot legislate morality, then it cannot condemn a man for raping a woman, or a woman for strangling her newborn child. And it can certainly not administer any sort of punishment. If the government cannot say that rape is wrong, how can it then provide for a punishment for rape? It is therefore practically necessary that the government legislate morality. And for this reason, the moral question of abortion is well within the reasonable and practical scope of government."
    }, {
      "p" : "If we can agree, then, that life is sacred and that our government has the philosophical and practical right to uphold or condemn abortion to the degree that it sees fit, then we can push more towards the heart of the matter. It seems to me that there are two main questions regarding abortion upon which people disagree. The first is this: at what point, if any, does a human developing in the womb qualify as a person whose right to life must be protected? The second question is thus: if and when a human life in the womb does qualify as a person, what principles or conditions might override the baby's right to live and thus make abortion morally permissible?"
    } ]
  },
  "blogs" : {
    "-MHrtzpf94QBrRmta3k9" : {
      "date" : "2021-06-10T13:00",
      "description" : "Believing and defending important doctrines is an essential component of the Christian faith.",
      "id" : "-MHrtzpf94QBrRmta3k9",
      "title" : "The Importance of Doctrine",
      "topic" : "theology"
    },
    "-MN_CvUuFui4b6h7yfc_" : {
      "date" : "2021-01-06T00:00",
      "description" : "Christians must respect God-given authority, and leaders must lead with self-emptying, Christ-exalting humility.",
      "id" : "-MN_CvUuFui4b6h7yfc_",
      "title" : "Humility and Authority",
      "topic" : "theology"
    },
    "-MRGzr7JPENTZ9MP2_ND" : {
      "date" : "2021-02-05T11:45:06.782",
      "description" : "The Trinity provides a scripturally-accurate understanding of God as he has revealed himself in his Word.",
      "id" : "-MRGzr7JPENTZ9MP2_ND",
      "title" : "One God, Three Persons",
      "topic" : "theology"
    },
    "-MhtYh1PcEAinLKEh5F9" : {
      "date" : "2021-09-18T11:21:08.564",
      "description" : "On Moral Relativism and the Doctrine of Divine Revelation",
      "id" : "-MhtYh1PcEAinLKEh5F9",
      "title" : "What is Morality & Where Does it Come From?",
      "topic" : "philosophy"
    }
  },
  "blogsArchive" : {
    "-MHru1z7pRuQxHdKecEN" : {
      "date" : "2020-08-14T18:39:25.2777",
      "description" : "Faith in Christ is more than mere intellectual concession; it must originate from the heart.",
      "id" : "-MHru1z7pRuQxHdKecEN",
      "title" : "The Importance of the Heart",
      "topic" : "theology"
    },
    "-MHru5-r9fquK12Gbbf1" : {
      "date" : "2020-08-16T18:39:25.2777",
      "description" : "Faith in Christ is more than mere intellectual concession; it must originate from the heart.",
      "id" : "-MHru5-r9fquK12Gbbf1",
      "title" : "The Importance of the Heart 2 ",
      "topic" : "theology"
    },
    "-MHruUy1Yb6IJR40olBH" : {
      "date" : "2020-08-22T18:40:25",
      "description" : "The Bible is clear: we don't need bother loving ourselves. We must love Christ and others.",
      "id" : "-MHruUy1Yb6IJR40olBH",
      "title" : "The Self-Love Delusion",
      "topic" : "culture"
    },
    "-MIAQ6EILtwo7q720wpM" : {
      "date" : "2020-09-26T11:18:34.205Z",
      "description" : "Description",
      "id" : "-MIAQ6EILtwo7q720wpM",
      "title" : "Title",
      "topic" : "theology"
    },
    "-MIAT2_JJKwydZvJQZBw" : {
      "date" : "2020-09-26T11:31:24.791Z",
      "description" : "Description",
      "id" : "-MIAT2_JJKwydZvJQZBw",
      "title" : "Title 2",
      "topic" : "theology"
    },
    "-MIAVXAxxhYdzFD8j1Rq" : {
      "date" : "2020-09-26T11:42:15.840Z",
      "description" : "Description",
      "id" : "-MIAVXAxxhYdzFD8j1Rq",
      "title" : "Title",
      "topic" : "theology"
    },
    "-MIAb2_9rmPJBPJxels_" : {
      "date" : "2020-09-26T12:10:43.598Z",
      "description" : "Description",
      "id" : "-MIAb2_9rmPJBPJxels_",
      "title" : "Title",
      "topic" : "theology"
    },
    "-MIAfGadBqxbOAiD8e0n" : {
      "date" : "2020-09-26T12:29:01.028Z",
      "description" : "Description",
      "id" : "-MIAfGadBqxbOAiD8e0n",
      "title" : "New Test Article",
      "topic" : "theology"
    },
    "-MJ_J81olOiqndVKS7oE" : {
      "date" : "2020-11-27T19:38:15.815Z",
      "description" : "There are many good logical and scientific reasons to believe that abortion is morally wrong and unacceptable.",
      "id" : "-MJ_J81olOiqndVKS7oE",
      "title" : "A Secular Argument Against Abortion",
      "topic" : "politics"
    }
  },
  "editors" : {
    "lRPmWupEOfTPhNW119UYydEQZmh1" : true
  },
  "episodeContent" : {
    "-Mt0z4jx-sudxoqwiO_b" : [ {
      "h3" : "The Troubled Seas"
    }, {
      "p" : "Welcome to the first episode of Anchor for the Soul. My name is Jaden Hicks, and what I want to talk about today is really very simple. It's the name of my podcast, Anchor for the Soul."
    }, {
      "p" : "If you've ever read Hebrews, you know that Paul is writing to a group of people who have had a troubled time. In chapter 10, Paul recounts of their former days when they \"endured a hard struggle with sufferings, sometimes being publicly exposed to reproach and affliction, and sometimes being partners with those so treated\" (vs. 32, 33). Yet in the midst of suffering, they \"had compassion on those in prison,\" and they \"joyfully accepted\" the plundering of their property, since they knew that they \"a better possession and an abiding one\" (vs. 34). Of all the reactions I could imagine to the plundering of my property, joy is not one of them. Yet in the midst of troubled seas, seas far more fearsome than most of us have ever experienced in our lives, they had hope. And that is the type of hope that I desire to have, that I long to share, and that I want to talk about today."
    }, {
      "h4" : "Understanding the troubles"
    }, {
      "p" : "I want to begin with a question: how do we have that kind of hope? I think the answer is simple yet difficult and diverse. And I think a good place to begin is with this: understand the troubles. Or more specifically, understand the /i purpose/ of the troubles."
    }, {
      "p" : "There are so many difficulties that we face in our lives. There are struggles and conflicts between friends and family. There is social isolation and judgement because of faith in Christ. There are doubts and fears about what's to come, about what we believe. There are questions we cannot answer, giants we fear we cannot face, loved ones we lose, sorrows unimaginable. I can only begin the things that other have experienced, my troubles are so light, yet I am sure of one thing: none of our suffering is meaningless."
    }, {
      "p" : " "
    } ]
  },
  "episodes" : {
    "-Mt0z4jx-sudxoqwiO_b" : {
      "date" : "2022-01-09T22:13:26.444",
      "description" : "\"We have this hope as an anchor for the soul, firm and secure.\" – Heb 6:19",
      "id" : "-Mt0z4jx-sudxoqwiO_b",
      "pid" : "eibid7",
      "title" : "#1 Anchor for the Soul",
      "topic" : "theology"
    }
  },
  "topics" : [ "Theology", "Philosophy", "Culture", "Politics" ],
  "unpublished" : {
    "blogContent" : {
      "-MIAMIi9zB9ROYPDPZFZ" : [ {
        "p" : "In my life I have had many questions and doubts. Many times has my soul been shaken, tossed to and fro by the waves of vain philosophies, blown under by the fear of uncertainty. Challenges have cut to the core of my faith; the deceptive poisons of sin have numbed my spirit, almost clogging those glorious springs of eternal life with doubt and shame. But such trials have taught me the strength of truth: anchors of reality that stretch down through the foaming waters to find solid rock and hold the soul in place no matter the strength of the storm. My dear friends, we do not need all the answers to survive in the world as Christians. We simply need an anchor for the soul, a firm and secure understanding to cling when all else shatters and fails. Though our souls may be shaken, they will not be lost if we can only grab hold to something firmer than doubt: a base understanding of reality to fall back to when our outposts fall, a place to keep us alive and grounded, a place to prepare our next advance."
      } ],
      "-MItrhun5n958fDTCVP6" : [ {
        "p" : "There is a grand difference between the soft blanket definitions we give feminism and the real broader contexts and consequences that surround it. At a very basic level, feminism is the belief in the equality of the sexes. This blanket statement, from a certain angle, is entirely uncontroversial. The Bible consistently maintains that men and women have equal intrinsic worth and value before God: we are all, male and female, human beings created in the image of God (Genesis 1:27). And with regard to our faith and unity in the body of Christ, \"there is no male and female\"; we are united perfectly together in love as the sons and daughters of God through our faith in Jesus Christ (Galatians 3:24-29)."
      }, {
        "p" : "But, unfortunately, feminism does not end with this blanket definition. It reaches much farther and far deeper. Careful consideration is needed to understand the true nature of feminism in its broader context, and to see more fully the crucial points of conflict between modern feminism and Christianity."
      }, {
        "h3" : "#1 Men and Women Are Different"
      }, {
        "p" : "Men and women are equal in intrinsic worth and value, but feminists typically mean much more than that when they talk about \"equality.\" Equal, in their minds, really means \"the same.\" Men and women are not collectively unique. They are the same, and they must be treated as the same. Consequently, there are no objective grounds for having different standards or roles for men and women in society, the church, or the family."
      }, {
        "p" : "Don't believe me? Ask a feminist what it means to be a man or a woman. They may tell you about physical differences: the male and female sexes are unmistakably different in their physical biologies. They might talk about gender as a societal construct: masculinity and femininity are simply cultural standards that can be changed; they don't have any objective or intrinsic meaning. This is why men can be women, and women can be men; or, more accurately, anyone can be anything at any given time for no other reason than that they feel like it. And if you're lucky, they might even admit to certain physcological and emotional differences between men and women. But you will be very hard-pressed to find any feminist who will agree that men and women are fundamentally, objectively, collectively, and intrinsically different."
      }, {
        "p" : "You see, there is a thing called a man, and a thing called a woman, and you are either one or the other, as was determined by God before you are born. This fact is testified daily by not only our human genome, but by the deepest and most fundamental parts of our metaphysical beings. This reality is unchangeable and vastly beautiful and important, it has crucial spiritual implications for your life, and it has real practical consequences for your roles in the family, church, and society. That is what the Bible teaches, and that is what feminists categorically deny. "
      }, {
        "p" : "Let me seek to demonstrate this biblically. Genesis 1:27, before mentioned, is the first of two biblical accounts of the creation of man:"
      }, {
        "p" : "\"So God created man in his own image, in the image of God he created him; male and female created he them.\" – Genesis 1:27"
      }, {
        "p" : "As Raymond C. Ortlund, Jr. explains, \"Each of these three lines makes a point. Line one asserts the divine creation of man. We came from God. Line two overlaps with line one, except that is highlights the divine image in man. We bear a resemblance to God. Line three boldly affirms the dual sexuality of man. We are male and female. Nowhere else in Genesis 1 is sexuality referred to; but human sexuality, superior to animal sexuality, merits the simple dignity given it here. Further, Moses doubtless intends to imply the equality of the sexes, for both male and female display the glory of God's image with equal brilliance. . . .\" He also points out that, \"in verse 28, God pronounces His benediction on man. In verse 22, God spoke His blessing out over the mass of the lower creatures. But here in verse 28 we read, 'God blessed them and said to them. . . .' With man alone male and female alike without distinction, God shares an I-thou relationship. In His benediction the Creator also authorizes male and female together to carry out their mission to rule the lower creation.\" In conclusion, he writes, \"Man was created as royalty in God's world, male and female alike bearing the divine glory equally.\""
      }, {
        "p" : "We see then that from the beginning God created two objective categories that describe mankind: male and female. There is no third or fourth category; there is only those two, and they are not the same. If they were, why would Moses uniquely emphasize the duality of mankind and not the other animals? There must be some important distinctions between man and woman, but as to the exact nature and particularities of these distinctions, we have yet to consider."
      }, {
        "h3" : "#2 Men and Women Have Different Roles"
      }, {
        "p" : "Now, some of you may have been cruising by pretty easy so far. You might be thinking, \"Of course men and women are different. You're just assuming the more extreme positions of feminism. Just because I'm a feminist doesn't mean I deny mankind's duality or think that people are free to identify as whatever they want.\" Well, let me see if I can ruffle your feathers with this next point: if male and female are indeed significantly different objective categories of mankind, then their differences should be reflected significantly within differing roles. As said before, this applies to family, church, and society; and really it applies to every form of relationship between one person, male or female, and another person, male or female."
      }, {
        "p" : "Before we get into the Bible, please go ahead and get any slanders or misrepresentations you may have out of the way early: \"You're a male chauvinist. You are the definition of toxic masculinity.\" My personal favorite, \"What, you just want women to stay home barefoot and pregnant in the kitchen?\" And maybe once these have been exhausted we can actually talk about what the Bible teaches."
      } ],
      "-MMHvStt5zkVaFo_yg5W" : [ {
        "h3" : "Header"
      }, {
        "p" : "Paragraph"
      } ],
      "-MNC9NBbOa2HUtQzACLu" : [ {
        "h3" : "Introduction"
      }, {
        "p" : "There are few subjects as contested or as important as abortion. The stakes are incredibly high. If abortion is not ultimately wrong, and fetuses are not human persons, then those who campaign against it risk restricting the rights of women and the freedom of individuals. If abortion is wrong, and fetuses are human persons, then those who campaign for it risk standing aside as hundreds of millions of lives are massacred in the womb. Therefore, we cannot ignore this issue. We cannot defer our judgements. It is the impending ethical question of our time. So I exhort my reader, whether for or against or in between: evaluate your position deeply and carefully; know what you think and why you think it. There is too much at stake to do anything less."
      }, {
        "p" : "In respect to the importance and weight of this discussion, let me be clear about my intentions. In this article, I will argue that abortion is morally wrong. I will do so without appealing to the authority of any religious texts, but rather by appealing to basic morality, scientific evidence, and logical reasoning. My argument will not be based upon biblical authority, but upon the logic and observation of the natural law. One may disagree with my position, perhaps thoroughly and passionately, but I ask that you do so in honesty and in fairness, with full consideration and balanced judgement."
      }, {
        "h4" : "Terminology"
      }, {
        "p" : "First of all, let us get our terms straight. Conception occurs when a sperm cell fuses with an egg cell. The result is a single-celled human organism called a zygote. The zygote begins dividing rapidly to form a multi-cellular embryo. After several weeks in the womb, the embryo has grown and developed enough to be recognizably human and is called a fetus. The term fetus applies until the entity is born from the mother's womb. I will use the term baby to generally describe a human organism at any of these developmental stages — zygote, embryo, or fetus — not for purposes of persuasion, but for simplicity of expression."
      }, {
        "p" : "Abortion, by definition, is the termination of a pregnancy (in the broadest since). The consequence of this, I will argue, is that abortion destroys the life of the human organism in the womb. The term pro-life describes the position that abortion should be restricted or outlawed by the government; one could also call it anti-abortion. Pro-choice, on the other hand, describes the position that a mother should decide in her individual context whether or not to have an abortion, with limited to no government restrictions."
      }, {
        "p" : "I use the term life generally to describe things that are scientifically living (they exhibit all the right biological characteristics for life). The term human applies to any organism that has human biology and human genetics (as opposed to the biology of a bear or a tree). Zygotes are characteristically human: they are not eagle eggs or plant seeds; they are human zygotes. They have 46 chromosomes with the appropriate placement of genes. The term person is more philosophical. Persons are individuals who have natural rights—say, to Life, Liberty, and the Pursuit of Happiness. In my mind, uppercase Life is a right not only to be biologically living, but to /i live/: to make friends, learn things, fall in love, have a family, build a community, and so on. It is one's right to experience their existence without infringment by the government or other people, so long as they are not infringing upon another's ability to do the same."
      }, {
        "h4" : " A Basic Argument"
      }, {
        "p" : "My argument against abortion is, fundamentally, quite simple.  1. Life is sacred, so intentionally taking an innocent life is wrong.  2. Life begins at conception, so abortion intentionally takes an innocent life.  3. Therefore, abortion is wrong. To invalidate this argument, there are three main routes one can take: 1. They can argue that life is not sacred.  2. They can argue that life does not begin at conception. 3. Or, they can claim that certain confounding factors must qualify the argument. In others words, the argument is too simplistic."
      }, {
        "h3" : "Life is Sacred"
      }, {
        "p" : "As to the first route, I sincerely hope that none would be so cruel and callous as to argue that human life is not sacred. For if one does, then there are many difficulties. If life is not sacred, then why is murder wrong? If life is not sacred, then why is slavery a moral evil? Why, I ask, if life is not sacred, cannot one massacre 1.7 million Jewish people or starve 10 million others? The answer, quite clearly, is that human life /i is/ sacred. It is precious and valuable. It should not be stolen or falsely infringed upon. The principle that life is sacred is foundational to any good and just society. Without it we can have no meaningful system of morality or justice. Therefore, I hope we can at least agree upon the general principal that life is indeed sacred."
      }, {
        "p" : "I also hope that we can agree that the government carries a primary responsibility to protect it. Put plainly, if the government has not the responsibility to protect the sanctity and dignity of human life, then murder must go unpunished and slavery left unimpeded. Without this principle, we would have had no basis for using our government infrastructure for such moral goods as defeating the Nazis and toppling the Soviet Union. Therefore, I make two contentions. One, that human life is sacred, and two, that governments must protect it."
      }, {
        "p" : "Now, to be fair, one may claim that murder is wrong not because life is sacred, but because ________ is sacred. You fill it in. Sentience, consciousness, personality, etc. Or the more atheistic types, with an aversion to the term sacred, might say that life is useful, or necessary for the propagation of our species, or valuable according to the overwhelming subjective opinion of the naturally evolved perspective of mankind."
      }, {
        "p" : "In fairness, however, qualifications can be made to this principle. Many people who oppose abortion support giving murderers and rapists the death penalty. Some charge this as a contradiction, but it is not. When we give the death penalty to a murderer, we uphold due justice. We say that, because they violated the sanctity of another's life, we forfeit the sanctity of their own. An eye for an eye. If you intentionally kill someone, then there will be an equal and complementary consequence. The motive is not to devalue the life of the criminal, but to properly respect the life of the victim. We wish to give a towering incentive not to commit murder. One may still oppose the death penalty for various reasons, but it falls short of an honest contradiction with the sanctity of life."
      }, {
        "p" : "Society makes another qualification on the sanctity of life during wartime. You kill the enemy; the enemy kills you. Every decent person acknowledges that war is awful, treacherous, in all cases the last resort, but there comes a time when it is truly necessary. How else could we have stopped the Nazis from slaughtering more Jews? How else could we have ended slavery in the United States? In both of cases, the war was necessary and, I would argue, morally positive. The mass death required by them was a high price to pay, with no shallow implications, but we had to pay it. We had to pay such a high price to say that massacring 1.7 million people or enslaving hundreds of thousands of people is wrong. In other words, we payed it to uphold the sanctity of life. Thus, I make it my position that any situational qualification we wish to impose upon the sanctity of life must have, as its ultimate purpose, the desire to uphold the sanctity of life."
      }, {
        "h3" : "Life Begins at Conception"
      }, {
        "p" : "The second premise of my argument is this: life begins at conception. "
      }, {
        "p" : "To this first route, I sincerely hope that none should be so callous and cold as to try it. To the second I shall talk here. And the third I will address later. Does life being at conception."
      }, {
        "h3" : "We Should Err on the Side of Personhood"
      }, {
        "p" : "We ought always to err on the side of personhood. Some suggest that, because there are so many disagreements and contentions about abortion, we should refrain from imposing any restrictions on it; just let the mother decide. It is entirely the opposite. The level of disagreement and contention about abortion today should lead us to enact restrictions most readily. For if we are to deny the personhood of a million humans per year and then leave them to the mercies of a mother’s whim or doctor’s infanticide, we better be pretty damn sure we have gotten things right. And until we agree that we have, we should not dare take such a risk. A million lives a year is far too high a price to pay for being wrong. "
      }, {
        "p" : "If this needs more convincing, consider the perspective of the mid-nineteenth century centrist. Some say that slavery is good and necessary, that it helps and protects the slaves. And there are these scientists who claim that white people are genetically superior, smarter, and more capable. They say slavery is crucial to the social fabric and very necessary for a prosperous economy. Who else will grow the cotton? On the other hand, some say that slavery is morally detestable. It is wrong to cast thousands in chains, to abuse them and steal their labor, to exploit an entire race of people, rape their wives, and break up their families. You might then hear the modern pragmatist responding: \"well, with all the argument and controversy, individual slave-holders should make up their own minds. Let them decide whether they shall keep their slaves or set them free, not the government.\" To this, I would resoundingly reply, in the same manner, that we should always err on the side of personhood. That the risk of demeaning, dehumanizing, and exploiting a great many thousands is far too high a price to pay for being wrong. You see, those who err against the personhood of a human being almost always end up on the wrong side of history. "
      }, {
        "p" : "Now, you may remark that I lay too much responsibility at the feet of society rather than the individuals. The individual mothers who get an abortion will be independently responsible for their actions; they shall give account for themselves. And the slave-holders were each individually at stake for holding their slaves. Such is the result when we allow individual decision-making. Virtually everyone agrees, however, that slavery placed guilt not only on the slave-holders but on the entire society and culture that let it flourish. There was a societal responsibility and a societal impetus to remove slavery from its borders. The same is true for us today. If abortion is, as I argue, a tremendous evil against humanity, then not only the individuals but the society is guilty and must work to rid itself of the evil. "
      }, {
        "h3" : "Babies in the Womb Are Persons"
      }, {
        "h3" : "Mothers Must Be Cared For and Protected"
      }, {
        "h3" : "Adoption"
      }, {
        "h3" : "Special Cases"
      }, {
        "h4" : "The Cases of Rape and Incest"
      }, {
        "h4" : "The Case of Saving the Life of the Mother"
      }, {
        "h4" : "The Case of Babies With Disabilities"
      } ],
      "-MQmfvkpzapZgSJ-9BwF" : [ {
        "p" : "There are two ways a man can respond to the beauty of nature. On the one hand, he can praise nature for its own sake. He can behold the starry sky, the evening sunset, the forest bursting with green life, and he can awe at the spectacular intricacy of its physics and biology and chemistry, and how the energy and matter and space and time all collide and coincide to form this beautiful tapestry of artistic genius. This he surely can do."
      }, {
        "p" : "Or, he can praise the Creator of the creation. He beholds the starry sky, the evening sunset, the forest bursting with green life, and considers the grandeur of nature's spectacular intricacy, but he goes a step further. He sees them as a pointer, a giant arrow in the sky pointed at the invisible God, the infinitely wise and magnificently creative Creator all things, and this he worships in his heart."
      }, {
        "p" : "But whether one worships the creature or the Creator, all must worship. For how can a man bask in the beauty of a starry night without finding in himself any presence of admiration, or awe, of intense wonder? Such, for the overwhelming majority of humanity, would seem an impossibility."
      }, {
        "h3" : "The Biblical Idea"
      }, {
        "p" : "Of these two reactions, the Bible affirms the second and condemns the first. "
      } ],
      "-MSnWGZZEMqys30E31sl" : [ {
        "p" : "Genesis 1:1 teaches us a great many things about the God of the Bible. “In the beginning, God created the heavens and the earth.” We can deduce by the phrase, “in the beginning,” that God is eternal and everlasting. He preceded the existence of all things. He is the first and only uncaused cause. And from the second part of the verse we see that God has remarkable power. He “created the heavens and the earth.” All he had to do was speak, and that which he said came into existence."
      }, {
        "p" : "Many other passages can tell us that God is omniscient. He knows everything (1 John 3:20). Isaiah 46:9-10 reads, “I am God, and there is none like me, declaring the end from the beginning and from ancient times things not yet done, saying, ‘My counsel shall stand, and I will accomplish all my purpose.’” God clearly has a knowledge of everything that will occur, “declaring the end from the beginning,” and deliberately brings it to pass: “I will accomplish my purpose.”"
      }, {
        "h4" : "Introduction"
      }, {
        "p" : "My purpose in this article, however, is not to establish the biblical doctrine of God’s sovereignty, or his power over creation, but to present a philosophical argument for why such is logically consistent. If God is eternal, omniscient, and the Creator of all things, then it follows that He, whether directly or indirectly, ordains and establishes everything that comes to pass. God, from the broadest trends to the smallest details, is totally and ultimately and decisively in control of the universe. Nothing happens apart from the final authority of God."
      }, {
        "h3" : "Two Types of Agency"
      }, {
        "p" : "To make my argument, I should first like to define two types of agency which God exerts over the universe: /i creative agency/ and /i interactive agency/. Creative agency is that agency which God exercised (past) over creation by creating it to be the way He created it to be, rather than some other way. Interactive agency is that agency which God exercises presently over creation through the way in which He interacts with it."
      }, {
        "h4" : "Creative Agency"
      }, {
        "p" : "Let us examine the moment of creation (if one can truly call it a “moment”). When God created the universe, He had before him an infinite number of options as to how the universe would be. Perhaps event X would occur; perhaps it would not occur. Perhaps the laws of physics would work in this way, or perhaps they would work another way. Maybe humans have gills and live underwater, or maybe they have lungs and live on land. God could have created the universe in a billion different ways, but He chose to create it exactly as it is."
      }, {
        "p" : "Now, because God is omniscient, He has perfect knowledge of what each of these universes would be like. Not only does He know everything about our universe, but He knows exactly how our universe would be different if it changed in this or that way. Think about it this way. Our universe was created with a certain set of preconditions: natural laws and processes set to govern how our world progresses from one moment to the next. These laws and processes form a sequence of causality spanning all the way back from the initial creation to the present day. In other words, the events of the universe are not random. They are consistently governed by universal laws towards a predictable outcome."
      }, {
        "p" : "What is the implication? That God, in his infinite knowledge, would have known exactly how the universe would progress from start to finish given any particular set of preconditions. From the initial state, He would have known the final state, and every state in between. Therefore, when God created the universe, He was not only choosing the universe’s beginning. He was choosing its entire history. For this I say God has exercised creative agency over the universe. Whatever happens, God knew it would happen when He created the universe, and thus, by creating the universe in this way, He ordained it to come to pass. He could have easily chosen a universe where it did not happen, but instead He chose one where it did."
      }, {
        "h4" : "Interactive Agency"
      }, {
        "p" : "Now, if God were simply to create the universe in its initial state and throw back his hands, then it would naturally progress towards its predictable end. The sequence of causality would proceed uninterrupted from outside forces, because the only outside force would be God. But what if God chooses to interact with the universe, and even interferes with its natural course of events? This is what I call interactive agency."
      }, {
        "p" : " Had God never met with Abraham and given him a promise, then the nation of Israel might never have come into existence. Thus God, in choosing to interact with Abraham in the way that he did, effectively changed the course of history from what its original preconditions might have produced on their own. Or, to give an even greater example, consider how the Son of God took upon himself flesh and entered into the world through the virgin Mary. Clearly God has interacted with the universe in remarkably influential ways."
      }, {
        "p" : "We must remember, however, that it is not as if God looks upon creation and suddenly changes His mind about how things out to be. Rather, God designed the universe with a complete understanding of exactly how He would interact with it, and exactly how that would change the natural course of things. We cannot view God as if constrained by time, for He created time. Thus, God's exercises His creative agency in conjunction with His interactive agency, and thus chose to make the universe the way He did /i in light of/ how He would interact with mankind and the universe throughout history."
      }, {
        "h3" : "The Objection"
      }, {
        "p" : ""
      }, {
        "h3" : "The Argument"
      }, {
        "h3" : ""
      } ],
      "-MTwp8LWFTh7xCDJ1Z1B" : [ {
        "p" : "The heart has a remarkable capacity to justify what it enjoys. Pornography is no exception. Though a man may vehemently despise the shame which he brings upon himself when he sells himself to the pleasures of sin, the fact remains that he's willing to do it, over and over again. One must ask the question, then, why? If one truly understood the act for what it was, and truly felt the hatred for it that it deserved, then how could they still let pornography lay claim to their soul? Surely they could not. Rather, they must not understand it for what it is, nor hate it as they should. They must be, in their mind and in their heart, thoroughly deceived by sin."
      }, {
        "h3" : "A Definition of Lust"
      }, {
        "p" : "\"For this is the will of God, your sanctification: that you abstain from sexual immorality; that each one of you know how to control his own body in holiness and honor, not in the passion of lust like the Gentiles who do not know God; that no one transgress and wrong his brother in this matter, because the Lord is an avenger in all these things, as we told you beforehand and solemnly warned you. For God has not called us for impurity, but in holiness. Therefore whoever disregards this, disregards not man but God, who gives his Holy Spirit to you.\" – 1 Thessalonians 4:3-8"
      }, {
        "p" : "The only way to be free of the deception of sin is to be renewed in the mind and transformed in the heart by the Spirit of God. The primary means which the Holy Spirit uses in its sanctification of believers is that piercing, double-edged sword, the word of God. There are many warnings throughout scripture about the dangers of sexual immorality, and the first we can observe is here in 1 Thessalonians."
      }, {
        "p" : "We learn that God's will for us in our sanctification is that we abstain from sexual immortality. Rather, let every man \"control his own body in holiness and honor,\" and \"not in the passion of lust like the Gentiles who do not know God.\" What we're not supposed to do is commit acts of sexual immorality in the faithless passions of lust. What we are supposed to do is control our own bodies in holiness and honor. This means that lust, and the resulting acts which are forbidden by Scripture, are those sexual passions and actions which lack holiness and honor. In the words of John Piper, \"Sexual desire in itself is good. God made it in the beginning. It has its proper place. But it was made to be governed or regulated or guided by two concerns: honor toward the other person and holiness toward God. Lust is what that sexual desire becomes when that honor and that holiness are missing from it\" (\"Battling the Unbelief of Lust\"). Thus, to understand pornography as a sinful act of lust, we must see how it lacks holiness toward God and honor towards others."
      }, {
        "h3" : "Holiness Toward God"
      }, {
        "p" : "\"Let marriage be held in honor among all, and let the marriage bed be undefiled, for God will judge the sexually immoral and adulterous.\" – Hebrews 13:4"
      }, {
        "p" : "God's judgement always implies a standard by which to judge. Namely, God judges according to the law which he has provided. When God created Adam and Eve to be together, male and female, it is said, \"Therefore a man shall leave his father and his mother and hold fast to his wife, and they shall become one flesh\" (Genesis 2:24). Herein is the biblical definition of marriage. Man is created male and female, and when a man leaves his mother and father, makes a marital covenant before God with a woman, and they come together in the act of sex, then they are said to be one flesh. They are united before God and man. Their bodies are under the authority of one another (1 Corinthians 7:4)."
      }, {
        "p" : "Here in Hebrews, the writer instructs us that the institution of marriage, as one ordained by God and cherished by God, should be held in honor among all, and that the marriage bed should remain undefiled. In other words, the marital bed should remain pure and exclusive to a husband and his wife, without either spouse veering off into other sexual relationships, passions, actions, or thoughts. \"For God will judge the sexually immoral and adulterous.\""
      }, {
        "h4" : "Porn as Adultery"
      }, {
        "p" : "So, for the married man or woman, the problem with pornography is quite apparent. The husband is joined to his wife, and the wife to her husband, and their sexual union is holy and honorable before God. Pornography, however, necessarily breaks that unity and defiles the marital bed. While watching porn, the husband or wife entertains fantasies, thoughts, and passions apart from their spouse. They engage in acts not in exclusive and intimate adoration and love for their spouse, but in pursuit and adoration of another. This damages and obstructs the beautiful and delicate bond of intimacy designed to gloriously unite them in marriage."
      }, {
        "p" : "Jesus makes this clear in his sermon on the mount. “You have heard that it was said, ‘You shall not commit adultery.’ But I say to you that everyone who looks at a woman with lustful intent has already committed adultery with her in his heart\" (Matthew 5:27-28). Not only the act of adultery breaks the marital covenant and will incur the righteous judgement of God. But even the act of lusting after a woman commits adultery in the heart. Even though physical bodies may not touch in pornography, the heart nevertheless experiences the reality of adultery as if they were."
      }, {
        "h4" : "Porn as Fornication"
      }, {
        "p" : "For the unmarried person, however, the problem of pornography may not seem as apparent. There is no spouse, no marital covenant which they are breaking in their lustful acts. So why are they condemned?"
      }, {
        "p" : "In the first place, God's design for sex to be contained in marriage holds true for both the married and unmarried. Just as it is sin for a married man to engage in sex with a woman who is not his wife, it is sin for an unmarried man to engage in sex with a woman who is not his wife. The only difference is that the married man has a proper context for sex, the marital bed, and the unmarried man does not."
      }, {
        "p" : "Second of all, the unmarried person has the potential for marriage. Marriage is such a glorious and deep bond between a man and woman that it demands fidelity even before it is commenced. A married man must honor his present wife, but an unmarried man must honor the possibility of his future wife. She deserves fidelity now just as she will when finally found."
      }, {
        "p" : "So pornography remains unholy before God for the unmarried man because, 1) When a man watches porn, he engages in sexual passions and acts outside of marriage, violating God's holy standard for human sexuality, and 2) He dishonors his future wife, if God grants him to be married, by entertaining lustful passions for other women."
      }, {
        "h3" : "Honor Towards Others"
      }, {
        "p" : "\"Now the body is not for sexual immorality but for the Lord, and the Lord for the body. And God both raised up the Lord and will also raise us up by His power. Do you not know that your bodies are members of Christ? Shall I then take the members of Christ and make them members of a harlot? Certainly not! Or do you not know that he who is joined to a harlot is one body with her? For ‘the two,’ He says, ‘shall become one flesh.’ But he who is joined to the Lord is one spirit with Him. Flee sexual immorality. Every sin that a man does is outside the body, but he who commits sexual immorality sins against his own body. Or do you not know that your body is the temple of the Holy Spirit who is in you, whom you have from God, and you are not your own? For you were bought at a price; therefore glorify God in your body and in your spirit, which are God’s.”"
      }, {
        "p" : "When one watches pornography, there are three main categories of those whom they injure or dishonor. 1) They dishonor themselves. 2) They dishonor others. 3) Most importantly, they dishonor God."
      }, {
        "h4" : "1) They dishonor themselves in that they bring shame and desolation upon their body."
      }, {
        "p" : "The women or men whom they are lusting after on the screen are prostitutes, however aggrieved and abused they may be. The porn watcher is taking these prostitutes and joining themselves to them. This, clearly, is a tremendous insult to their own body. Their body is meant to be presented as \"a living sacrifice, holy and acceptable before God.\" Their body is to be raised up and glorified in the last day to be with Christ. Their body is the temple, the sacred dwelling place, of the Holy Spirit of God. When one takes the precious body which they have charge over, and joins it to a prostitute for the mere temporary exercise of sexual pleasure, they are dealing a tremendous insult to themselves. They are desecrating their own value. Just as they are treating the object of their lust as a sexual object, they are by implication treating themselves as a sexual object. And are they not so much more than a sexual object?"
      }, {
        "h4" : "2) They dishonor others by watching porn in manifold ways."
      }, {
        "p" : "In the first place, as just mentioned, they treat the persons in the video not as sacred persons, created in the image of God, but as objects for their sexual pleasure. This is an insult to them, who are worth more and deserving of so much more respect."
      }, {
        "p" : "Sure, many offer themselves freely to be dishonored and disrespected in this way, but this means nothing. A person may offer themselves up to be murdered, but that in no wise makes their murderer any less guilty. When one breaks God's holy law and dishonors another person, it matters not if that person consents to being dishonored. It it still a heinous crime against the law of God. "
      }, {
        "p" : "Additionally, anyone who consents to being dishonored in such a way must be dreadfully deceived by sin. How do you know that they were not manipulated, taken advantage of in some dire situation, naive and not understanding the reality of the exploitation they consented to? Sin surely is never justified by the consent of those enslaved by it. But even this leaves out the painful fact that the porn industry is built upon slavery. How many of the people on the screen were sold into slavery as children and forced into the brutal business of their exploitation? How can you know that they were not sexual slaves? By watching porn, you both presently dishonor and exploit the souls that are before you on the screen, and you sponsor the continued enslavement and manipulation of others to be dishonored and exploited in the same way."
      }, {
        "p" : "Finally, porn unfaithfully dishonors either your present spouse, or the possibility of your future spouse, by engaging in sexual passions or actions outside of the pure and scared context of marriage. "
      }, {
        "h4" : "3) Finally, and most terribly, they who watch porn dishonor God."
      }, {
        "p" : "In the first place, they injure God by insulting themselves and others. God hates the exploitation of those whom He lovingly created. Thus, God hates it when we disrespect both ourselves and others. He is grievously wronged by such an insult to His creation."
      }, {
        "p" : "In the second place, God is wronged by our disregard for his beautiful standard of marriage. He has provided us a wonderful, deep, and holy context for sexuality, yet we have thrown it aside and engaged in the debased passions of lust. God is thus insulted by our blatant disregard for his loving commandments. "
      }, {
        "p" : "In the third place, God is dishonored when we watch pornography because the body which we enjoin to prostitutes is not our own, but His, and the dwelling place of His Holy Spirit, and the vessel which He will raise on the last day. \"The body is not for sexual immorality but for the Lord\" (1 Corinthians 6:13). \"Or do you not know that your body is the temple of the Holy Spirit who is in you, whom you have from God, and you are not your own? For you were bought at a price; therefore glorify God in your body and in your spirit, which are God’s\" (vv. 19-20). Christ payed the very price of his own blood to secure your redemption, and you are now going to enjoin the body which he bought to a prostitute? You are going to desecrate the temple of his Holy Spirit by joining it with the body of a harlot? That body which will be resurrected to the glory of God, you will now surrender to the object of dishonorable passions? How could God not be severally and cosmically insulted by such a blatant betrayal of his holiness? "
      }, {
        "p" : "And finally, in the fourth place, pornography injures God by undervaluing his worth. God is holy and beautiful, and the fountain of all blessing. He is intended to be the object of our greatest delight, the fulfillment of our deepest desires for pleasure. When we indulge in pornography, we are effectually saying that porn is more delightful and more satisfying than holy and everlasting intimacy with God. We are taking more pleasure in the vile filth of sin than in the pure and undefiled love of God. We are removing God from his proper throne in our hearts, as the supreme object of our worship and adoration, and instead enthroning and delighting in a mere temporary and defiled act of sexual immorality. This drastically insults God's worth, by displacing Him with something that is worth far less. "
      }, {
        "h3" : "A Closing Prayer"
      }, {
        "p" : "I pray that through this article you come to a deeper understanding of the vile dangers and dreadful ramifications of pornography. I pray that the Spirit would use God's piercing Word and my meager words to sanctify and enlighten your mind to see pornography as it is, black, wretched, and perverted. I pray that this enlightenment would shine into your heart, that through proper understanding you may come to hate pornography with a righteous hatred, with the intensity with which God hates it. And finally, through this sanctification of the Spirit, this renewal of mind and heart, I pray that you would find strength and desire to abstain from all sexual immorality, to steer free of every passion of lust, and to control your own body in holiness and honor, treating it as that holy and acceptable sacrifice, bought with the precious blood of Christ and in-dwelt by the Holy Spirit of God, that you may honor yourself, others, and the very God who loves you and created you to delight in Himself."
      } ],
      "-MUvO5nQ2k3bTCFf0hLF" : [ {
        "h3" : "The Utility of Marriage"
      }, {
        "p" : "There is only one type of union between two people that has the potential to make more humans: the union between a man and a woman. Two men can’t make a baby. Two women can’t make a baby. But a man and a woman, they can have a child. For this reason, society has an invested interest in the union of a man and woman that it does not have in a partnership between two men or two women. Only the former can propagate the species and grow the nation. Children are fundamental to the successful progression of human society. They are priceless and beautiful. Any one child could change the world in spectacular ways. Thus, there is something very special about a man and woman together in marriage, something that should be preserved and invested in."
      }, {
        "p" : "Additionally, there is a unique capacity for man and woman together to raise a child. A good father offers something to his children that the mother cannot provide. A good mother offers something to her children that the father cannot provide. Both have their unique qualities and attributes that, when joined together, form the most successful child-rearing system. Two women, or two men, cannot raise a child in the way one man and one woman can. Children deserve both a father and a mother."
      }, {
        "p" : "Thus, the union of a man and woman offers two very priceless things: the ability to make children, and the best context in which to raise them. For these two things, government should sponsor marriage and define it properly as the union of one man and one woman. They should value it greatly above a partnership between two men or two women, if not because of the moral and religious significance of the God-ordained institution, because of the priceless services it offers to society."
      }, {
        "p" : "One might respond that homosexual couples can adopt. They can raise children. Should not this service be sponsored by the government? No, it should not. In fact, it should by prevented. In the first place, as mentioned above, they cannot offer the same range of services that a mother and father can. Every child should get the opportunity to have a mother and father. Additionally, a homosexual couple will have negative effects on children. Daughters raised by two men will not learn the beauty of being a woman, nor gain the particular knowledge that only a mother can provide. Thus, they will struggle in certain ways and tend to be more masculine. Sons raised by two women will not learn the beauty of being a man, nor gain the particular knowledge that only a father can provide. This, too, will cause them to struggle and tend to be more feminine. They will suffer from the lack of a good model for a relationship between the sexes. And, finally, should we really sponsor an activity or lifestyle that, if practiced widely, would halt the progression of human society by preventing the proper conception and rearing of children?"
      }, {
        "p" : "Am I arguing, then, that children should not be raised by a single parent, man or woman? Of course not, given that the man or woman is the biological parent of the child. Children tend to do better when raised by their biological parents; ideally, their mother and father. However, if only the mother or father is present, for whatever reason, they should not be robbed of their biological parent. On the flip side, however, when a child is up for adoption, they should not readily be given to a single man or woman. They, of course, deserve to have a mother and father."
      } ],
      "-MZycQbTsk6SroApIgAd" : [ {
        "p" : "Not quite finished..."
      }, {
        "p" : "The Bible could hardly be more clear about God's vision for human sexuality. Genesis 2:24 reads, \"Therefore a man shall leave his father and his mother and hold fast to his wife, and they shall become one flesh.\" The only context in which sex is meant to occur, in the Christian worldview, is marriage: one man and one woman in a lifelong commitment to each other. Not only is sex before marriage forbidden (generally fornication), and sex outside of marriage forbidden (adultery), but Jesus tells us that even looking upon a woman \"with lustful intent\" is sinful (Matthew 5:28). Thus, the sexual ethic of Christianity goes like this: if you are married, direct all of your sexual passions — your thoughts, desires, and actions — into your marriage; if you are not married, then control those passions, abstain from sexual fantasy and activity, and dedicate yourself to the Lord."
      }, {
        "p" : "The modern position is quite the opposite. Sex, they might say, should not be so restricted. We should be free to express our sexuality in whatever way we choose, with whomever we choose, whenever we choose. Sexuality, some contend, is crucial to our individuality. To stifle sexual passions is to stifle the individual. And beyond that, sex is natural. Animals have sex, and we evolved from them with the same instincts, so why should we deny and starve our own basic biological needs? Indeed, one of the only widespread limitations of sexuality in the modern ethic is the necessity of consent. As long as you want to and I want to, then there's hardly a problem. Of course, many still believe that adultery is wrong because it violates a personal commitment, but for the unmarried person especially, the reigns are considerably loosened."
      }, {
        "h3" : "When Worldviews Collide"
      }, {
        "p" : "We see, then, two opposing ways to approach the issue of human sexuality. Should sex be restricted only to marriage? Is fornication a sin? What system leads to the highest degree of intimate delight and human flourishing? Who gets to make the rules about sex, and why? These questions are at the heart of the modern debate on sexual morality. I contend that when we analyze more closely these two conflicting ideologies, we find that the Christian ethic is not only more honorable, respectful, and holy than its secular counterpart, but more conducive to joy, resistant to pain, and freeing to the human spirit."
      }, {
        "h3" : "Fornication is Disrespectful"
      }, {
        "p" : "Let us first take a closer look at the secular formula for sexuality. For the unmarried person, it is supposedly okay to have sex as long as the person is old enough and gives their consent. This can occur with someone you hardly know at all, or within the context of an intimate relationship. Both of these, however, have serious problems."
      }, {
        "h4" : "Hookup culture dishonors everyone"
      }, {
        "p" : "A big problem with hookup culture (having sex outside of a committed relationship) is that it is dehumanizing and impersonal. When one has casual sex with someone else, they are not acknowledging, desiring, or honoring that person as a real, deep, and beautiful human soul. They are ignoring all of the intrinsic, unique, and complex layers of personality simply to use the outward body as a means to their own sexual satisfaction. This infinitely valuable person made in the image of God is reduced to a mere sexual object. The significance of that person as an eternal soul who could suffer in hell eternally for their unbelief and disobedience is entirely ignored. And this dehumanization goes two ways. You are treating them as an object, and consequently they are treating you as an object. There is a mutual stream of disrespect. Does anyone honestly want to be treated as an impersonal means to someone's selfish sexual gratification? Or do we want to be treated as valuable and beautiful human beings, more than just a body, persons with a mind and heart and soul. If we wish to be treated in this way, then we should stop openly exposing ourselves to mistreatment and start treating others the way we wish to be treated. This means that we do not present ourselves to be used as a sexual object, and we do not seek to use others as one either."
      }, {
        "h4" : "Fornication is disrespectful to yourself"
      }, {
        "p" : "But what about sex within the context of an intimate relationship less serious and exclusive than marriage? If two people are in a relationship, say boyfriend and girlfriend, and they really love each other and truly desire one another as persons, why should they be prevented from experiencing the joys of sexual intimacy? This is because of the nature of sex: it is intimate. Even impersonal sex initiates and develops sexual desires, fantasies, and connections to the other person which are broken with difficultly. But real, personal sex forms an even deeper bond, a truer and more intimate connection, which is thus even more difficult and painful to break."
      }, {
        "p" : "Such a deep and intimate bond fits well within the context of marriage — in a deep and lasting commitment. When two people get married, they are saying to each other, \"I want you, and only you, till death do us part.\" They are promising for the rest of their lives to romantically pursue, desire, and have sex with that person, and that person only. The deep and personal bond of sexual intimacy can thrive in the kind of trust and security that such a covenant brings. But a less committed relationship, a relationship where tomorrow your boyfriend or girlfriend could wake up and decide they never want to talk to you again, cannot handle such a bond."
      }, {
        "p" : "As long as there is the direct and open opportunity for you or them to abandon the relationship, sex is a tremendous risk. By having sex, you are giving your heart and body to someone who could abandon you in an instant. You risk forging an intimate connection which can only end in the deep pain of rejection. Breakups are already difficult. Having sex only exacerbates the pain and heartbreak of severing yourself from someone you love. Though you may experience the temporary joys and privileges of sexual intimacy, you also risk the pain and heartbreak of losing those privileges. By waiting until marriage to have sex, not only do you significantly reduce the likelihood of experiencing such pain, you also enjoy greater depths of intimacy which can only develop within the bounds of the trust and safety forged by commitment."
      }, {
        "h4" : "What about divorce?"
      }, {
        "p" : "You may contend, however, that marriage is also a risk, because marriages can end in divorce. This risk is especially prevalent in today's America, where divorces can be obtained without fault. And it's true, there is always the potential of betrayal: the possibility that your spouse will be unfaithful to you and commit adultery; the possibility that they will reject you, divorce you, abandon you. And there is the sense in which divorce is much more painful than a breakup because of the commitment it dishonors. Not merely are you being severed from a person to whom you've given your life, heart, and body, but you are being severed from a person who made vows to you, who committed themselves to you, who is now betraying you by breaking their covenant."
      }, {
        "p" : "All of this is real and true and devastating, but it does not justify fornication. It only proves the necessity of finding a good spouse, someone you can honestly trust to be faithful to you, to keep their vows and honor their commitment. You can never eliminate the possibility of rejection and hurt, but you can minimize it. Premarital sex is asking for it. Marriage with an untrustworthy person is significantly risking it. But a real commitment with someone you honestly believe to be trustworthy and accountable minimizes the risk of pain, and thus maximizes the potential for lasting intimacy and joy. "
      }, {
        "h4" : "Fornication is disrespectful to the other person"
      }, {
        "p" : "Having sex while dating does not make sense from a purely self-oriented perspective. It provides stunted pleasure in exchange for significant risk. But having sex while dating also dishonors the other person. First of all, you are exposing them to the same type of risk to which you are exposing yourself. Not only could they abandon you, but you could abandon them. You are not only significantly risking your own pain, but selfishly subjecting /i them/ to the risk of pain. But also, what does it say about your love for the other person if you desire to have sex with them, but are unwilling to fully commit yourself to them? In the end, we have the same problem that we have with hookup culture. You want the person to fulfill your sexual needs and desires for intimacy, yet you don't love them enough to truly commit yourself to them. You want all the benefits of marriage without the responsibility and commitment that protect and honor the other person. Such is selfish and disrespectful. If you want the pleasures of intimacy, you must make the sacrifice of commitment. Thus, having sex while dating is not only harmful to yourself, but disrespectful and dishonoring to the other person."
      }, {
        "h4" : "Fornication is disrespectful to your future spouse"
      }, {
        "p" : "Let's take it one step further. Premarital sex is disrespectful to your future spouse. A marital vow begins once it is spoken. Thus, sex before marriage is not adultery. It is not directly breaking a marital vow. But that does not mean that it doesn't bring harmful and difficult consequences into a marriage. When a person sleeps around, or has sex with multiple intimate partners, they are training themselves to be unfaithful to their spouse. By directing their sexual energy in so many directions, they are making it more difficult to learn how to direct all of their sexual energy towards one person in a marriage. Men are natural-born polygamists — with unchecked opportunity, they would have sex with as many women as they possibly could. The same can be true of women. Thus, monogamy — channeling all of the many rivers seeking to diverge into one stream of passion and love — is already exceedingly difficult for us to learn. Premarital sex only makes this process harder by reinforcing our polygamist instincts. The same holds true for lust, masturbation, and pornography. The more you diversify your streams of sexual passion, the harder it becomes to consolidate and direct them all towards one person. When you fail to direct all of your sexual passion towards your spouse, some inevitably flows somewhere else, resulting in unfaithfulness, the breaking of the marital vows. Breaking marital vows, of course, means betraying and dishonoring your spouse. Not only that, but the more your streams are spread out, the weaker the flow towards your spouse will be. Some of the sexual energy that should have been directed into your marriage was directed elsewhere, undermining both trust and intimacy. Thus, sexual passion before marriage disrespects your future spouse by reinforcing the habits which lead to unfaithfulness — and in the most severe case, adultery — and undermining a strong flowing intimacy."
      }, {
        "p" : "But that’s not the only way fornication harms marriage. Premarital sex brings loads of emotional baggage from past breakups. First of all, there is the remains of past bonds forged by sexual intimacy. Giving ourselves so fully to someone cannot be reversed; the bond it forms can hardly be eradicated entirely. There will remain an element of the passion and desire from that past intimate relationship that will diminish your passion for your spouse in marriage. It is as if you have dug a canal for your sexual stream to diverge into and out of your marital covenant. Fornication makes faithfulness harder in marriage by digging a fast track to unfaithfulness, whether in thought or in action."
      }, {
        "p" : "But then there’s also the hurt and rejection experienced when you had to sever your sexual bond with that person. Such pain doesn’t simply evaporate: it too has lasting effects. One who’s felt betrayed may become skeptical and develop a resistance to trust another person and, ultimately, their spouse. One who has betrayed a close partner will find it easier to betray again. Whichever way it goes, the breakups of previous sexual relationships jeopardize the potential for trust and faithfulness in marriage."
      } ],
      "-Mbde1oBt9i7IUEytszw" : [ {
        "p" : "In economics you learn about two types of profit: accounting profit and economic profit. Accounting profit is what we generally associate with the term \"profit\": what you get, minus what you directly gave for it. When you sell lemonade, for example, your accounting profit is how much people pay you minus the cost of the resources (lemons, sugar, and so on) that went into production. Economic profit, on the other hand, is what you get, minus what you gave to get it, minus what you /i could/ have got from your best alternative option. The economic profit from selling lemonade would be how much people pay you, minus the cost of your resources, minus what you could have made from selling tea or lemon pie, for example. This idea of economic profit is used in economics to make decisions about the best way for a company to utilize their resources. If you can make more money selling tea, then your economic profit from selling lemonade will be negative, so you know that you should stop putting your resources into lemonade and start selling tea."
      }, {
        "p" : "Well, this economic idea has an important (if surprising) application to sex. In fact, I think it provides a useful intellectual framework for better understanding and implementing the biblical view of sexuality. When we consider sexual matters, we must consider not only the accounting profit, but the economic profit."
      }, {
        "h3" : "The Satisfaction of Sin"
      }, {
        "p" : "The first thing to establish is that sin can indeed bring temporary satisfaction. If it didn't, we wouldn’t do it. We commit sexual sins because we enjoy them. We think that we are gaining something, whether it be intimacy, sensual pleasure, physical and hormonal relief, or otherwise. And in the moment, we can experience such things. We temporarily if not lastingly believe that our sin is increasing our net total enjoyment. But while this may be true of short-term accounting enjoyment, it is not true of short or long-term economic enjoyment."
      }, {
        "h3" : "The Direct Costs of Sin"
      }, {
        "p" : "Sexual sin brings temporary pleasure, but their are long-term direct and implicit costs. Namely, the Bible presents a striking motivation not to sin: eternal and infinite suffering in hell. While instructing the Thessalonian church to abstain from sexual immorality, Paul remarks, “that no one transgress and wrong his brother in this matter, /i because the Lord is an avenger / in all these things, as we told you beforehand and solemnly warned you” (1 Thessalonians‬ ‭4:6‬). The message is clear: abstain from sexual immorality — sex outside of a faithful union between a man and woman in marriage — because the Lord will avenge all wrongdoing. We see then a massive direct cost of sin. While the payment is not immediately required, one day each and every person will stand before God and be judged for their actions, and exact recompense for sin will be required."
      }, {
        "h3" : "The Implicit Costs of Sin"
      }, {
        "p" : "But wrath is only half of the Gospel. In Romans 1, Paul gives a direct link between God’s wrath and God’s grace. In verse 18 we read, “For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men.” That’s a scary prospect. But in the previous two verses Paul gave the answer to that problem. “For the gospel is the power of salvation to everyone who believes, to the Jew first and also to the Gentile. For in it the righteousness of God is revealed from faith for faith, that as it is written, ‘the righteous shall live by faith.’” You see, God’s wrath against our sin is our great problem, but God’s righteousness revealed in the gospel of His Son is our great salvation. Namely, he was “delivered up for our trespasses, and raised for our justification.” When we put our trust in Christ, our sin is paid for by the blood of his cross, saving us from the wrath we deserve, and his prefect righteousness is counted to us, bringing us access to God’s perfect grace."
      }, {
        "p" : "The extent of this grace has no bounds. Christ is the joy of our salvation, our peace, our greatest comfort, the pearl of great price. “In his presence is fullness of joy, and pleasures forevermore.” While hell is a place of infinite and eternal suffering, heaven is a place of infinite and eternal pleasure. Therefore, when we live a life of sin, we not only bring ourselves eternal and infinite suffering, but we miss out on eternal and infinite pleasure. We exchange an infinite blessing for an infinite curse. So the cost of our sin is even higher than just hell. The implicit cost of our sin is heaven."
      }, {
        "h3" : "The Result"
      }, {
        "p" : "So let us consider the true costs of our sin. We may want to ha e sex with our girlfriend or boyfriend, but in doing so we move ourselves and our partner one step closer to hell, and one step farther from heaven. Whatever temporary sexual satisfaction there is to be gained from our actions will have a painful direct cost in hell. Our long-term accounting profit is already negative. We’re losing. But it also carries the infinite implicit cost of communion with Christ. Our economic profit is infinitely negative. What we’re getting cannot even begin to compare to what we find in Christ."
      }, {
        "p" : "Why? Because sin and holiness are incompatible. Godliness and godlessness cannot exist and persist together. The Spirit and the flesh are at war, at enmity with one another. We cannot swell in sexual sin while enjoying communion with Christ and his Spirit, just as we cannot have sex with other people while enjoying faithful intimacy with our spouse. They are mutually incompatible. When you commit sexual sin, you are momentarily gaining the pleasure you receive from that sin, but you are sacrificing the higher and more glorious and fulfilling pleasure of communion with Christ, and the joy of God's perfect plan for our sexuality. Therefore, while you may have a positive accounting profit from sexual sin, it will give you a drastically negative economic profit. The eternal love, peace, and joy that you are forfeiting is worth far more than the temporary pleasure you derive from sin."
      }, {
        "p" : "Think about that next time you are tempted to sin!"
      } ],
      "-MhKmGlPUnqX1oFO6ZvP" : [ {
        "p" : "Article Series (In Progress)"
      }, {
        "h3" : "Part One -- The Objection and its Root"
      }, {
        "p" : "A chief teaching of the Bible, and most emphatically the New Testament, is the doctrine of divine judgement and retribution: all men will be judged by God in the last days, and unbelievers will be cast into hell for eternity as a punishment for their sins and sinful nature. Believers indeed deserve hell for their sin and would end up there if not for the intervening blood of Christ. It is often summed up like this: all sin and evil will be punished by God; either you will bear the full weight of your sins in hell, or through faith in Christ your sins will have been paid for by his precious blood. This indeed is the entire purpose of Christ's death on the cross. \"He himself bore our sins in his body on the tree, that we might die to sin and live to righteousness\" (1 Peter 2:24). In Ephesians chapter one we read of Christ: \"In him we have /i redemption through his blood/, the /i forgiveness of our trespasses/, according to the riches of his grace, which he lavished upon us, in all wisdom and insight making known to us the mystery of his will, according to his purpose, which he set forth in Christ as /i a plan for the fulness of time/, to unite all things in him, things in heaven and things on earth\" (Eph. 1:7-10). We see then that our redemption and forgiveness is in the blood of Christ, and that such is God's beautiful and wise plan for the fulness of time: to unite all things in Christ by his blessed accomplishment of salvation. On the flip side of this, however, are the many who reject Christ and His offer of salvation, or never even hear it. What can we say about these? Shall they really deserve eternal death. In this series, I shall seek to most faithfully unpack the seriousness of sin and the dire state of man’s relation to God. But only for this reason: that the salvation of Christ may only shine more brightly by contrast, that through understanding our sin, we may better come to cherish the blood of Christ which paid our debt and brought our reconciliation with God."
      }, {
        "h4" : "The Objection"
      }, {
        "p" : "It is often believed that most people are good. Exceptions exist. There are those like Hitler and Stalin whose depths of evil go unchecked by constraints, who step far across the line of morally acceptable behavior. There are those few who might actually merit eternal retribution for their evil. But not most. No, the average man is good. They are not perfect, but they certainly don't deserve eternal damnation."
      }, {
        "p" : "Grounded by this belief, many assert that the God of the Bible is unjust to proclaim that every man deserves eternal damnation by his own merit. Thus, many reject the Bible on the ground of God's perceived unjust attitude towards the majority of humanity which they believe to be, overall, morally acceptable. In this series, I will seek to examine the flaws in this way of reasoning. Note that I will assume the existence of God: an omniscient, omnipotent Creator of the universe. My goal in this series is not to argue for God’s existence, but to demonstrate the compatibility of the doctrine of hell with a theistic worldview."
      }, {
        "h4" : "The Justice of God"
      }, {
        "p" : "The first thing to be established in defense of the biblical doctrine of divine judgement is the fundamental reality and necessity of the justice of God. The Bible or course unquestionably maintains that God is just and that He “judges justly” (1 Peter 2:23). Indeed, injustice is so often the charge made by men against God, that all seem to acknowledge that a true God must be just. A God who is unjust in His dealings with His creatures would neither be good nor worthy of praise."
      }, {
        "p" : "To demonstrate this I want to give two examples. In the first, imagine a man who has been falsely accused of murder. You sit through his trial as the prosecution presents weak evidence and deceptive arguments, and you listen to the defense emphatically demolish the charges against this man. Now imagine, at the end of this trial, hearing the verdict: \"Guilty!\" But that's just the beginning. The man has been sentenced to death. Who among us, I ask, would not be horrified by such a failure of justice, that an innocent man is being punished, and in so terrible a manner? You see, we all believe in justice when it comes to never punishing the innocent, and so does the Bible. God was willing to spare the cities of Sodom and Gomorrah for the sake of ten righteous people, so far is it from God to ever inflict undue punishment on the innocent."
      }, {
        "p" : "But what about a second example? Now imagine that you are sitting in a court room as a rapist is brought to trial. You sit there and listen as the prosecution presents layer after layer of damning evidence undoubtedly proving the guilt of this man. You watch as his victim, brought to stand trembling with tears, testifies of the pain and brokenness he has caused her. Who among us would not feel in our hearts a deep and passionate anger, a righteous condemnation for this man and his actions? And who, I ask, would not drop their jaw in complete and utter astonishment when the judge, gavel in his hand, declares \"You are guilty, but no punishment shall come upon you. You have done this evil deed, but your iniquity shall not be repaid\"? Not only would we be astonished, we would be entirely disgusted at this judge over his decision. We would consider him not fit to be judge, because he has failed at his one fundamental responsibility: to uphold /i justice/. This is because justice not only excludes punishment for the innocent, but requires punishment for the guilty. The nature of justice is such that every sin must be proportionately and exactly punished, and every righteous deed proportionately and exactly rewarded. Deviating from this standard in either direction, either towards over-punishment or under-punishment, is the very nature of injustice."
      }, {
        "p" : "Consider this: If we love what is good, then that which transgresses and insults and degrades and violates goodness should be rightly hated and just as rightly punished. A world without justice is a world none of us wish to inhabit. We cannot tolerate injustice within our systems of government and authority — that is why we are disgusted when the guilty escape their due retribution. How much more intolerable, then, would injustice be in the cosmic authority, in the universal governorship of God over His creation? We expect justice from our leaders; how much more shall we expect justice in God?"
      }, {
        "p" : "We all have in us, somewhere beneath our seared and stained consciousness, the unbending commitment to justice in the world. To object to the justice of God is not only to diminish His holiness, but to deny the universal testimony of God written upon the human conscious. A God who is good, who loves what is right, must proportionately hate what is evil. And in so hating evil, He would be required by His own perfect and holy nature to so proportionately punish those guilty of it. "
      }, {
        "p" : "If God were to freely observe evil in the universe, fully understanding the way in which it insulted and undermined goodness, and yet respond with only absolute indifference and inaction, then we would conclude that He does not really love what is good. And what could be a more insufferable and self-contradictory and unbiblical idea than that God does not truly love what is good?"
      }, {
        "h4" : "The Root of the Objection"
      }, {
        "p" : "Now, if a love for good indeed necessitates a hatred and punishment of evil, then not many will object to a lasting and meaningful punishment for those like Hitler or Stalin, who murdered millions of people and caused unknowable degrees of devastation and chaos. Indeed, few of us could tolerate anything less! They clearly manifested unspeakable evil, and therefore clearly deserve proportionate punishment. But what about those average people? What about your next door neighbor? What about you? No surprise most of us dislike the idea of an eternal and infinite punishment for /i ourselves/. Consequently, when we look at our next door neighbor and many other people in the world, we don't like the idea of their eternal punishment either, because we see so little moral difference between us and them. After all, if the precious little old lady down the street deserves eternal punishment for her sins, how much more do you?"
      }, {
        "h4" : "(The Man-Centeredness of Man)"
      }, {
        "p" : "Thus, a very significant reason that so many believe most people to be good is that they believe themselves to be good. Just as much as they consider themselves unworthy of eternal punishment, they consider most others unworthy of eternal punishment. In other words, most of the moral judgements made by people about others are made relative to themselves. We tend to judge the actions of other people in relation to our own actions."
      }, {
        "p" : "We can admit to the evil of Hitler and Stalin because they were exceptional among mankind. We can judge guilty with such ardent passion the rapist and the murderer, because we ourselves are not guilty of such heinous sins. But when it comes to those average sins we've all committed, those little white lies, the aggressive and demeaning words and ungrateful attitudes, the everyday lusts and sexual objectifications, all those promises we've broken, the people we've betrayed, the opportunities for doing good that we've neglected; well, such little things can be forgiven, can't they? After all, everybody does those things. Would God really count us all guilty for such minor infractions? Would He really judge all of us so harshly?"
      }, {
        "p" : "And so, many believe that it's just not fair for God to judge the world with so straight and upright a measure. Such a conclusion does not arise out of any God-centered framework or concern, as I will show later, but out of our man-centered desire to justify ourselves and avoid admitting our guilt before God. We have the deep desire for justice when it comes to those much worse than ourselves, but we wouldn't dare apply justice to our own sins. We simply have too great a self-interest. "
      }, {
        "h4" : "An Exhortation to Honesty"
      }, {
        "p" : "We see then a powerful and selfish motivation within man which renders him naturally opposed to any idea of his own merit for damnation, especially eternal damnation. I say this because you, my reader, must understand what makes the charge against God's universal justice so potent. If you reject the idea of hell, you must realize your extraordinary self-interest in doing so. None of us want to go to hell, much less deserve it, so none of us are particularly inclined to believe that we deserve hell; indeed, we are monumentally inclined to believe that we do not. Thus, there is a considerable difficulty with maintaining an honest approach towards the subject, and we must be cognizant of this if we wish to proceed."
      }, {
        "p" : "We are inclined to believe that God would be cruel, harsh, and unjust to, as we see it, so severally punish the world. Thus, we are inclined to declare a God who would so punish us to be illegitimate. This is because our deepest natural allegiance is to ourselves. Natural man, fundamentally, worships no God before himself. But, unless you are perfect, a perfect and true God is bound to contradict you. If you find it inconceivable that the true God could ever contradict your deeply held understanding of the world, then it is because you do not worship any God but yourself."
      }, {
        "p" : "This is not to say we should blindly accept anything that is given to us, or totally abandon our grip upon reality. It is simply to say that we should expect a disjunction between our fundamental beliefs as man-centered humans and the fundamental truths of the God-centered God. Therefore, any honest effort to know the truth of God must be attempted with an acknowledgement of our own imperfection, and a willingness to be corrected. Let us then consider the matter humbly and honestly, rather than shrinking back into the incessancy of our pride. "
      }, {
        "h3" : "Part Two -- The Unrighteousness of Man"
      }, {
        "p" : "Is the average man, or greater than that, every man, guilty enough to deserve eternal damnation? This is the fundamental question we face. If God is just, and we are guilty, He has every right and responsibility to punish us. Therefore, the severity of our punishment depends on the severity of our guilt. If we are more good in our life than evil, then we are worthy of a reward. If we are more evil than good, then we deserve punishment. Such is the nature of justice: it is retributive. And in order to merit eternal damnation, not only must we be more evil than good, but infinitely more evil than good. An infinite punishment can only be merited by infinite evil. The question then becomes whether or not man can, and whether all men do produce and embody infinitely more evil than good."
      }, {
        "p" : "But even from this question arises another: what does it mean for man to do or be evil, and what does it mean for man to do or be good? This of course requires an understanding of what good and evil are. Therefore, I shall work backwards, starting with a brief definition of good and evil, then examining what it means for man to do and be good or evil, and finally arriving at a conclusion regarding the moral status of man. As my purpose is to defend the Christian doctrine, at each level I will present the biblical and God-centered answer to the question, before attempting to show and defend the validity of that answer."
      }, {
        "h4" : "What is good and evil?"
      }, {
        "p" : "The first question we must answer is perhaps one of the most fundamental of all questions: what is good and what is evil? Are they forces or entities in the universe, abstract inventions of the rational mind? Do they have metaphysical substance or reality? By what standard shall we judge the righteousness or unrighteousness of our actions and being?"
      }, {
        "p" : "The Biblical answer to the first question — what is good — is simply this: God is good. Good is not a reality outside of God’s existence, a force or rule which constrains Him. No, God is the ultimate reality, the uncaused cause of everything. Nothing constrains Him; He is completely free. Good, rather than an outside compelling force, is a word for /i the fundamental characteristic of the nature of God/. Good is not a reality with it’s own independent definition; we do not start with “goodness” and then declare God “good” because He fits its parameters. Rather, we start with God and the fundamental reality of His nature, and from that we define what it means to be good. God is good because goodness is defined by His nature."
      }, {
        "p" : "Such a definition of good is logically necessary in a theistic universe. Namely, if there is an ultimate being, it is necessary that nothing should precede or constrain or "
      }, {
        "p" : "Now, if good is defined by the nature of God, then the question “What is evil?” becomes a lot easier to answer. If evil is the opposite of good, and goodness is defined by who God is, than /i evil is whatever is opposite of or opposed to the nature of God/. Evil, like good, is not an independent metaphysical reality. Rather, evil is the negation of who God is. If God is something, than evil is the opposite. If God ever loves something, then evil hates it. If God does something, than evil does that which is opposed to God’s action. In every case, goodness is defined by God, and evil is therefore defined by the negation of that definition."
      }, {
        "p" : "Biblical support for this definition of evil:"
      }, {
        "h4" : "What does it mean to be good or evil?"
      }, {
        "p" : "The second question we face when we consider now the relationship of man to God, creature to Creator, is what does it mean for man to be good or evil? How does man do something good, or something evil? How does man qualify for the descriptive terms “goodness” or “wickedness”? How does the definition just presented of good and evil inform an understanding of how man can be righteous before God?"
      }, {
        "p" : "Here is how I would summarize the Biblical idea of goodness and wickedness in man. Goodness in man is the joyful disposition of obedience and conformity to God as our Creator, the fountain of all blessedness and the author of all good. Wickedness in man is the enslaving tendency to turn away from God and towards the vast emptiness of the self, rejecting God's ways in favor of his own futile desires and lusts. The fundamental concept is that righteousness or goodness turns out of oneself and fully towards God, while unrighteousness and wickedness turns fully away from God and towards oneself. It is a manner of what takes ultimate precedence in your life, desires, dispositions, and actions. Is God most properly seated on the throne of your heart, or have you replaced him either with an idol, or the most treacherous of rulers, yourself."
      }, {
        "p" : "Let us examine a few of the Biblical pictures that help demonstrate this understanding."
      } ],
      "-MiXYYXC3NZ24m8s-dpi" : [ {
        "h3" : "1. Reformed theology is a /i theology/."
      }, {
        "p" : "As RC Sproul points out in the beginning of his book, \"What is Reformed Theology?,\" Reformed theology is indeed a theology. This may sound redundant, but it is worth pointing out. In today's world, we are very apt to talk and learn about religion as opposed to theology. The difference is subtle but crucial. \"The study of religion,\" explains RC, \"is chiefly the study of a certain kind of /i human behavior/, be it under the rubric of anthropology, sociology, or psychology. The study of theology, on the other hand, is the study of God. Religion is anthropocentric; theology is theocentric.\" What Sproul is getting at is this: Reformed theology isn't asking \"What does man think about God?\" or \"What does man say about God?\". Reformed theology asks \"What has God said about Himself?\" Fundamental to reformed theology is the question of who God is. He is the central focus. God is not studied as an invention of man; man is studied as a creature of God."
      }, {
        "h3" : "2. Reformed theology is /i Protestant/."
      }, {
        "p" : "As its name implies, Reformed theology traces its roots back to the Protestant Reformation. Reformed believers can generally be described as those who follow the doctrines of the Reformers. Thus, they are dedicated to what is called the /i five solas/ of the Reformation, which I will briefly describe below."
      }, {
        "h4" : "Sola Scriptura (Scripture Alone)"
      }, {
        "p" : "Reformed theology is, in a sense, a tradition, but not one followed for the sake of tradition. Those who are mature in Reformed theology do not believe something because Martin Luther or John Calvin said so. They believe it because, in their conviction, the Bible says so. Luther and Calvin are believed to be reliable teachers, but only in so much as they handled the Word with accuracy and care. In other words, the final authority in Reformed theology is not any man or men, but the Word of God. Remember, Reformed /i theology/ is /it theocentric/, God-centered. The Scriptures are recognized as the Word of God, and thus they are just as authoritative and infallible as God is authoritative and infallible. Indeed, to believe the Scriptures one must believe that God is their ultimate author because the Scriptures themselves teach this doctrine! \"For no prophecy was ever produced by the will of man, but men spoke from God as they were carried along by the Holy Spirit. as they themselves claim to be (2 Pet. 1:21, see also 2 Tim. 3:16-17)."
      }, {
        "h4" : "Sola Christus (Christ Alone)"
      }, {
        "h4" : "Sola Fide (Faith Alone)"
      }, {
        "h4" : "Sola Gracia (Grace Alone)"
      }, {
        "h4" : "Soli Deo Gloria (to the Glory of God Alone)"
      }, {
        "h3" : "2. Reformed theology is /i theocentric/."
      }, {
        "p" : "Theocentric means God-centered. Theology is interested in God first, and God alone. It is not concerned so much with man in and of himself, but with man as he relates to his Creator. As RC emphasizes, \"Everything is theological.\" If everything in the universe is created by God, and God is the ultimate, central cause of all existence, the Great I Am, the beginning and the end, then God necessarily defines everything. All reality is made by God to testify to God. Of course, we cannot take sin by itself and say, \"if everything points to God, then God must be a sinner.\" No, by all reality, I mean all reality in conjunction. Sin in itself is treacherous and devastating and the exact opposite of the nature of God, but sin redeemed, sins covered are a glorious testimony to the grace of God; likewise sins judged and sins punished are a glorious testimony to the justice of God. In other words, God manifests Himself in all His glory through the history of creation, and most prominently through the revelation of his Son, Jesus Christ. Everything in conjunction, points to the glory of God. God is the center of everything in Reformed theology."
      }, {
        "h3" : "3. Reformed theology is Christian."
      }, {
        "p" : "This is quite clear from what I have said above, but it warrants independent clarification. Reformed theology, just as much as it is dedicated to the centrality of God in everything, is dedicated to the centrality of Christ who is God in everything. Christ, as the Bible tells us, "
      } ],
      "-MjL2_f57N1k9YZTXGTx" : [ {
        "p" : "The glory of God is the more manifested in some going to heaven while others go to hell, than if everyone were to go to heaven. God has so ordained creation, that everything accords with the highest, most excellent, most transparent, and most profound manifestation of His glory."
      }, {
        "h3" : "If everyone went to heaven..."
      }, {
        "p" : "1. We wouldn't fully see the consequences and result of belittling the glory of God."
      }, {
        "p" : "2. We wouldn't fully understand the unfathomable and awesome reality of mercy."
      }, {
        "p" : "3. God's glory would not be fully vindicated. If Christ took on the sins for every single person, and everyone's eyes were opened to the precious glory of God, the vindication of God's glory would not be complete. For we would see the severity of the punishment of Christ, but we would not see the end of a creature who does not glorify God. The glory of God would certainly be exalted in the severity of the cross, but the glory of god would not be exalted in the severity of man's end apart form God. In other words, Hell is necessary to demonstrate most vividly the primacy, importance, and indispensability of the glory of God."
      }, {
        "p" : "God is glorified by men in two ways. He is glorified in the man who is blind to the glory of God, then awakened to truth by the Holy Spirit to see and cherish and delight in glory of God. He is also glorified in the blind man whose eyes remain shut. He is glorified both by the precious realization of His glory, and the dire result of never seeing it. Is it unjust for God to will that some people never be saved? How could it be, if such was necessary for the deepest and brightest manifestation of his glory?"
      } ],
      "-MkF01QGyF3S_rimO8qk" : [ {
        "p" : "We have no reason to believe that the universe or its matter is eternal. Even if it was, we have no reason to believe that the complexity of matter, our minds, and all existence could spontaneously arise. Even if it could, we have no reason to assume that it ever would. The very fact that it did would be a miracle in and of itself, for it is much more likely for disorder to arise than such pristine order. Thus, not only must the atheist explain the existence of all things, but the remarkable nature of such things, and the profound unlikelihood if not impossibility of them being realized through any supposed natural mechanisms. The theist, on the other hand, has a perfectly reasonable explanation for not only the existence of things, but their complexity, and the realization of that complexity. Does this necessarily mean there is a God? No, perhaps not. But it does indicate that the existence of a God is the more reasonable theory as things now stand."
      }, {
        "p" : "One responds that I create a 'God of the gaps'. But do I? For what is a God but an ultimate, necessary, uncaused, noncontingent Being who is Himself the very power of being. Why does God explain the existence of all things? Because He Himself is the only source and author of existence. Why does God explain the realization of the complexity of the universe? Because He Himself designed it to be such as to fulfill His specific purposes. Does the rationality of God as the reason necessarily mean that He is the reason? This depends on whether another reason could be possible. Suppose that one is. Is it more likely? Not only can I find no more likely reason for the existence and complexity of reality than God, I can find no other reason at all."
      } ],
      "-MmJbBaULikjqfZGfUNZ" : [ {
        "h3" : "Header"
      }, {
        "p" : "Paragraph"
      } ],
      "-MmrzVt89o-re4sDkN6R" : [ {
        "p" : "Why is pornography wrong? For many, the answer to this question may seem obvious. How could it not be wrong? But I humbly ask you to consider the why. /i Why/ is it wrong? I am afraid the church is far better at emphasizing that it's wrong than explaining why it's wrong."
      }, {
        "h3" : "But why ask why?"
      }, {
        "p" : "But why should we ask such a question? Why is it necessary to explain why pornography is wrong? There are a couple important reasons. First of all, we live in a secular age that praises sexual immorality and mocks the Christian sexual ethic. Many if not most secular people in our culture see little inherent problem with pornography. Some even endorse the idea of women prostituting themselves and selling nude images and videos online as \"sex work.\" But it doesn't stop in the secular world. Far too many \"Christians\" follow the culture's ideas about sex more than the Word. I was stricken once when listening to a man who claimed to be Catholic as he mocked Tim Tebow for remaining chaste until marriage. I have heard far too many \"Christians\" brag about sexual experiences outside of marriage. Even more shocking, I have seen those raised in the church surprised to learn that the Bible forbids sex before marriage, as if they had never heard it! Sadly, the church is dramatically underperforming in the teaching and defense of its doctrines about sex."
      } ],
      "-Mt0z4jx-sudxoqwiO_b" : [ {
        "h3" : "Header"
      }, {
        "p" : "Paragraph"
      }, {
        "h4" : "Sub-heading"
      } ]
    },
    "blogs" : {
      "-MIAMIi9zB9ROYPDPZFZ" : {
        "date" : "2020-09-27T15:35:48.323",
        "description" : "Hebrews 6:19 – \"We have this hope as an anchor for the soul, firm and secure.\"",
        "id" : "-MIAMIi9zB9ROYPDPZFZ",
        "title" : "Anchor for the Soul",
        "topic" : "theology"
      },
      "-MItrhun5n958fDTCVP6" : {
        "date" : "2021-06-29T13:00",
        "description" : "Here are some of the many crucial conflicts between feminism and the Word of God.",
        "id" : "-MItrhun5n958fDTCVP6",
        "title" : "The Failures of Feminism",
        "topic" : "culture"
      },
      "-MMHvStt5zkVaFo_yg5W" : {
        "date" : "2020-11-16T14:22:34.251Z",
        "description" : "The Bible shows that abortion is immoral and inhumane.",
        "id" : "-MMHvStt5zkVaFo_yg5W",
        "title" : "Abortion: A Biblical Argument",
        "topic" : "theology"
      },
      "-MNC9NBbOa2HUtQzACLu" : {
        "date" : "2021-06-29T00:00",
        "description" : "Science and reason show that abortion is immoral and inhumane.",
        "id" : "-MNC9NBbOa2HUtQzACLu",
        "title" : "Abortion: A Secular Argument",
        "topic" : "theology"
      },
      "-MQmfvkpzapZgSJ-9BwF" : {
        "date" : "2021-01-11T11:19:18.237Z",
        "description" : "Romans 1:19 – \"For what can be known about God is plain to them, because God has shown it to them.\"",
        "id" : "-MQmfvkpzapZgSJ-9BwF",
        "title" : "God's Natural Revelation to Man",
        "topic" : "theology"
      },
      "-MSnWGZZEMqys30E31sl" : {
        "date" : "2021-02-05T11:45:29.403",
        "description" : "If God is eternal, omniscient, and the Creator of all things, then he must be ultimately sovereign over everything that occurs.",
        "id" : "-MSnWGZZEMqys30E31sl",
        "title" : "The Sovereignty of God: A Philosophical Approach",
        "topic" : "philosophy"
      },
      "-MTwp8LWFTh7xCDJ1Z1B" : {
        "date" : "2021-03-08T13:15:31.374",
        "description" : "Pornography strikes at the heart of our souls with deceptive pleasures to ensnare us in idolatry and dishonor.",
        "id" : "-MTwp8LWFTh7xCDJ1Z1B",
        "title" : "The Problem with Pornography",
        "topic" : "theology"
      },
      "-MUvO5nQ2k3bTCFf0hLF" : {
        "date" : "2021-03-03T20:41:27.699",
        "description" : "Description",
        "id" : "-MUvO5nQ2k3bTCFf0hLF",
        "title" : "Gay “Marriage”",
        "topic" : "politics"
      },
      "-MZycQbTsk6SroApIgAd" : {
        "date" : "2021-09-18T11:21:55.170Z",
        "description" : "It belongs in a fireplace.",
        "id" : "-MZycQbTsk6SroApIgAd",
        "title" : "Sex Is Like Fire",
        "topic" : "culture"
      },
      "-Mbde1oBt9i7IUEytszw" : {
        "date" : "2021-08-11T16:02:51.163Z",
        "description" : "Economics can teach us an important lesson about sex & sexuality.",
        "id" : "-Mbde1oBt9i7IUEytszw",
        "title" : "Sex & Economic Profit",
        "topic" : "culture"
      },
      "-MhKmGlPUnqX1oFO6ZvP" : {
        "date" : "2022-01-09T23:19:55.070",
        "description" : "All men deserve eternal damnation for sinning and falling short of the glory of God.",
        "id" : "-MhKmGlPUnqX1oFO6ZvP",
        "title" : "The Doctrine of Hell",
        "topic" : "theology"
      },
      "-MiXYYXC3NZ24m8s-dpi" : {
        "date" : "2021-09-01T00:01",
        "description" : "Six clarifications on the definition and fundamental beliefs of Reformed theology.",
        "id" : "-MiXYYXC3NZ24m8s-dpi",
        "title" : "What is Reformed Theology?",
        "topic" : "theology"
      },
      "-MjL2_f57N1k9YZTXGTx" : {
        "date" : "2021-09-11T13:16",
        "description" : "God is righteous to save some and not others.",
        "id" : "-MjL2_f57N1k9YZTXGTx",
        "title" : "Thoughts on Election",
        "topic" : "theology"
      },
      "-MkF01QGyF3S_rimO8qk" : {
        "date" : "2021-09-22T19:18",
        "description" : "Description",
        "id" : "-MkF01QGyF3S_rimO8qk",
        "title" : "Thoughts on the Existence of God",
        "topic" : "theology"
      },
      "-MmJbBaULikjqfZGfUNZ" : {
        "date" : "",
        "description" : "How can God justly condemn those who never hear the good news of Jesus?",
        "id" : "-MmJbBaULikjqfZGfUNZ",
        "title" : "What About Those Who Never Hear the Gospel?",
        "topic" : "theology"
      },
      "-MmrzVt89o-re4sDkN6R" : {
        "date" : "2021-10-25T10:07",
        "description" : "A Christian sexual ethic in an age of sexual liberalism.",
        "id" : "-MmrzVt89o-re4sDkN6R",
        "title" : "Why is Pornography Wrong?",
        "topic" : "theology"
      }
    }
  }
}
